#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
; shader debug name: a4ea2c77100d3d73f0173af9e9cf94d6.pdb
; shader hash: a4ea2c77100d3d73f0173af9e9cf94d6
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer cbPerObject
; {
;
;   struct hostlayout.cbPerObject
;   {
;
;       column_major float4x4 gWorldViewProj;         ; Offset:    0
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !36)
!1 = !DIFile(filename: "G:\5CEngine_file\5CgameEngine\5CGameEngineStart\5CGameEngine\5CAsset\5CShaders\5Chlsl\5CmainVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 3, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 3, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 18, type: !18, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !24}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 12, size: 256, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "PosH", scope: !20, file: !1, line: 14, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 15, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexIn", file: !1, line: 6, size: 224, align: 32, elements: !25)
!25 = !{!26, !35}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "PosL", scope: !24, file: !1, line: 8, baseType: !27, size: 96, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 3, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 3, size: 96, align: 32, elements: !29, templateParams: !33)
!29 = !{!30, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!33 = !{!13, !34}
!34 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !24, file: !1, line: 9, baseType: !4, size: 128, align: 32, offset: 96)
!36 = !{!37}
!37 = !DIGlobalVariable(name: "gWorldViewProj", linkageName: "\01?gWorldViewProj@cbPerObject@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !41, templateParams: !58)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !40, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!58 = !{!13, !59, !60}
!59 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!60 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!64 = !{!"G:\5CEngine_file\5CgameEngine\5CGameEngineStart\5CGameEngine\5CAsset\5CShaders\5Chlsl\5CmainVS.hlsl", !"cbuffer cbPerObject : register(b0)\0D\0A{\0D\0A\09float4x4 gWorldViewProj; \0D\0A};\0D\0A\0D\0Astruct VertexIn\0D\0A{\0D\0A\09float3 PosL  : POSITION;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0Astruct VertexOut\0D\0A{\0D\0A\09float4 PosH  : SV_POSITION;\0D\0A    float4 Color : COLOR;\0D\0A};\0D\0A\0D\0AVertexOut main(VertexIn vin)\0D\0A{\0D\0A\09VertexOut vout;\0D\0A\09\0D\0A\09// Transform to homogeneous clip space.\0D\0A\09vout.PosH = mul(float4(vin.PosL, 1.0f), gWorldViewProj);\0D\0A\09\0D\0A\09// Just pass vertex color into the pixel shader.\0D\0A    vout.Color = vin.Color;\0D\0A    \0D\0A    return vout;\0D\0A}"}
!65 = !{!"G:\5CEngine_file\5CgameEngine\5CGameEngineStart\5CGameEngine\5CAsset\5CShaders\5Chlsl\5CmainVS.hlsl"}
!66 = !{!"-E", !"main", !"-T", !"vs_6_1", !"/Od", !"/Zi", !"-Qembed_debug"}
!67 = !{i32 1, i32 1}
!68 = !{i32 1, i32 6}
!69 = !{!"vs", i32 6, i32 1}
!70 = !{null, null, !71, null}
!71 = !{!72}
!72 = !{i32 0, %hostlayout.cbPerObject* undef, !"cbPerObject", i32 0, i32 0, i32 1, i32 64, null}
!73 = !{i32 0, %hostlayout.cbPerObject undef, !74}
!74 = !{i32 64, !75}
!75 = !{i32 6, !"gWorldViewProj", i32 2, !76, i32 3, i32 0, i32 7, i32 9}
!76 = !{i32 4, i32 4, i32 2}
!77 = !{i32 1, void ()* @main, !78}
!78 = !{!79}
!79 = !{i32 0, !2, !2}
!80 = !{[10 x i32] [i32 8, i32 8, i32 15, i32 15, i32 15, i32 0, i32 16, i32 32, i32 64, i32 128]}
!81 = !{void ()* @main, !"main", !82, !70, !92}
!82 = !{!83, !89, null}
!83 = !{!84, !87}
!84 = !{i32 0, !"POSITION", i8 9, i8 0, !85, i8 0, i32 1, i8 3, i32 0, i8 0, !86}
!85 = !{i32 0}
!86 = !{i32 3, i32 7}
!87 = !{i32 1, !"COLOR", i8 9, i8 0, !85, i8 0, i32 1, i8 4, i32 1, i8 0, !88}
!88 = !{i32 3, i32 15}
!89 = !{!90, !91}
!90 = !{i32 0, !"SV_Position", i8 9, i8 3, !85, i8 4, i32 1, i8 4, i32 0, i8 0, !88}
!91 = !{i32 1, !"COLOR", i8 9, i8 0, !85, i8 2, i32 1, i8 4, i32 1, i8 0, !88}
!92 = !{i32 0, i64 1}
!93 = !DILocation(line: 18, column: 25, scope: !17)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vin", arg: 1, scope: !17, file: !1, line: 18, type: !24)
!95 = !DIExpression(DW_OP_bit_piece, 96, 32)
!96 = !DIExpression(DW_OP_bit_piece, 128, 32)
!97 = !DIExpression(DW_OP_bit_piece, 160, 32)
!98 = !DIExpression(DW_OP_bit_piece, 192, 32)
!99 = !DIExpression(DW_OP_bit_piece, 0, 32)
!100 = !DIExpression(DW_OP_bit_piece, 32, 32)
!101 = !DIExpression(DW_OP_bit_piece, 64, 32)
!102 = !DILocation(line: 23, column: 42, scope: !17)
!103 = !DILocation(line: 23, column: 14, scope: !17)
!104 = !DILocation(line: 23, column: 12, scope: !17)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vout", arg: 0, scope: !17, file: !1, line: 20, type: !20)
!106 = !DILocation(line: 26, column: 16, scope: !17)
!107 = !DIExpression(DW_OP_bit_piece, 224, 32)
!108 = !DILocation(line: 28, column: 5, scope: !17)

#endif

const unsigned char g_pmainVS[] = {
  0x44, 0x58, 0x42, 0x43, 0xc2, 0x6c, 0x45, 0x82, 0x94, 0xd1, 0xe2, 0x1d,
  0xa3, 0xe3, 0x01, 0x00, 0xfc, 0x65, 0x10, 0x56, 0x01, 0x00, 0x00, 0x00,
  0x4d, 0x24, 0x00, 0x00, 0x09, 0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00,
  0x54, 0x00, 0x00, 0x00, 0xb3, 0x00, 0x00, 0x00, 0x15, 0x01, 0x00, 0x00,
  0xf9, 0x01, 0x00, 0x00, 0xc5, 0x15, 0x00, 0x00, 0x25, 0x1c, 0x00, 0x00,
  0x59, 0x1c, 0x00, 0x00, 0x75, 0x1c, 0x00, 0x00, 0x53, 0x46, 0x49, 0x30,
  0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
