#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyzw        1     NONE   float   xyzw
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
;
; shader debug name: 5a3334943bbbee635264811d37cda3f3.pdb
; shader hash: 5a3334943bbbee635264811d37cda3f3
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !46)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent\5CModel_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 13, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 13, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 34, type: !18, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !41}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 26, size: 416, align: 32, elements: !21)
!21 = !{!22, !23, !24, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectedPosition", scope: !20, file: !1, line: 28, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPosition", scope: !20, file: !1, line: 29, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "WorldNormal", scope: !20, file: !1, line: 30, baseType: !25, size: 96, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 16, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 16, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "TextureUV", scope: !20, file: !1, line: 31, baseType: !34, size: 64, align: 32, offset: 352)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 16, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 16, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexIn", file: !1, line: 19, size: 256, align: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !41, file: !1, line: 21, baseType: !25, size: 96, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !41, file: !1, line: 22, baseType: !25, size: 96, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !41, file: !1, line: 23, baseType: !34, size: 64, align: 32, offset: 192)
!46 = !{!47, !71, !72, !73, !75, !77, !78, !80, !83, !85, !87, !89}
!47 = !DIGlobalVariable(name: "gModelMatrix", linkageName: "\01?gModelMatrix@PerBatchConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !51, templateParams: !68)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!68 = !{!13, !69, !70}
!69 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!70 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!71 = !DIGlobalVariable(name: "gViewMatrix", linkageName: "\01?gViewMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 11, type: !48, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gProjMatrix", linkageName: "\01?gProjMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 12, type: !48, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "gCameraPosition", linkageName: "\01?gCameraPosition@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 13, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!75 = !DIGlobalVariable(name: "gLightNum", linkageName: "\01?gLightNum@PerFrameConstants@@3HB", scope: !0, file: !1, line: 14, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!77 = !DIGlobalVariable(name: "clip_space_type", linkageName: "\01?clip_space_type@PerFrameConstants@@3HB", scope: !0, file: !1, line: 15, type: !76, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariable(name: "padding2", linkageName: "\01?padding2@PerFrameConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 16, type: !79, isLocal: false, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!80 = !DIGlobalVariable(name: "F0", scope: !0, file: !81, line: 1, type: !82, isLocal: true, isDefinition: true)
!81 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent/../Algorithm/CommonMath.hlsl", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!83 = !DIGlobalVariable(name: "PI", scope: !0, file: !81, line: 2, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!85 = !DIGlobalVariable(name: "F0.0", linkageName: "F0.0", scope: !0, file: !81, line: 1, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !82, size: 32, align: 4)
!87 = !DIGlobalVariable(name: "F0.2", linkageName: "F0.2", scope: !0, file: !81, line: 1, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !82, size: 32, align: 4, offset: 64)
!89 = !DIGlobalVariable(name: "F0.1", linkageName: "F0.1", scope: !0, file: !81, line: 1, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !82, size: 32, align: 4, offset: 32)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!94 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent\5CModel_VS.hlsl", !"#include \22../Algorithm/CommonMath.hlsl\22\0D\0A\0D\0Acbuffer PerBatchConstants : register(b1)\0D\0A{\0D\0A    float4x4 gModelMatrix;\0D\0A};\0D\0A\0D\0A// cb2\0D\0Acbuffer PerFrameConstants : register(b2)\0D\0A{\0D\0A    float4x4 gViewMatrix;\0D\0A    float4x4 gProjMatrix;\0D\0A    float4 gCameraPosition;\0D\0A    int gLightNum;\0D\0A    int clip_space_type; //0: opengl ,1: others \E8\A3\81\E5\89\AA\E7\A9\BA\E9\97\B4\E7\B1\BB\E5\9E\8B\0D\0A    float2 padding2;\0D\0A};\0D\0A\0D\0Astruct VertexIn\0D\0A{\0D\0A\09float3 Position  : POSITION;\0D\0A\09float3 Normal : NORMAL;\0D\0A\09float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOut\0D\0A{\0D\0A    float4 ProjectedPosition : SV_POSITION;\0D\0A    float4 WorldPosition : POSITION;\0D\0A    float3 WorldNormal : NORMAL;\0D\0A    float2 TextureUV : TEXCOORD;\0D\0A};\0D\0A\0D\0AVertexOut main(VertexIn vin)\0D\0A{\0D\0A    VertexOut vout;\0D\0A    float4x4 ProjectedMat = transpose(mul(gProjMatrix, gViewMatrix));   // V^T * P^T = (P * V)^T\0D\0A\09\0D\0A    //vout.ProjectedPosition = mul(mul(mul(float4(vin.Position, 1.0f), gModelMatrix), transpose(gViewMatrix)), transpose(gProjMatrix));\0D\0A\09\0D\0A    vout.WorldPosition = mul(float4(vin.Position, 1.0f), gModelMatrix);     // X * M = Xworld\0D\0A    vout.ProjectedPosition = mul(vout.WorldPosition, ProjectedMat);         // X*M*V*P = Xworld * (P * V)^ T\0D\0A    vout.WorldNormal = mul(float4(vin.Normal, 0.0f), gModelMatrix).xyz;\0D\0A\09vout.TextureUV = vin.Tex;\0D\0A\09return vout;\0D\0A}\0D\0A"}
!95 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent\5C..\5CAlgorithm\5CCommonMath.hlsl", !"static const float3 F0 = float3(0.04, 0.04, 0.04);\0D\0Astatic const float PI = 3.14159265358979;\0D\0A#define MAX_LIGHT_NUM 16\0D\0A\0D\0Afloat Pow5(float x)\0D\0A{\0D\0A    float xSquare = x * x;\0D\0A    return xSquare * xSquare * x;\0D\0A}\0D\0A\0D\0A// calculate hhomegeneous coordinates, trans (x, y, z, w) to (x', y', z', 1.0)\0D\0Afloat4 HomogeneousCoordinates(float4 position)\0D\0A{\0D\0A    return float4(position.xyz / position.w, 1.0f);\0D\0A}\0D\0A\0D\0A// KHR_texture_transform\0D\0A// input: TextureUV float2 offset float2 scale float rotation output: transformedUV \0D\0A// \0D\0A#define TEXTURE_TRANSFORM_COUNT 5\0D\0A\0D\0Afloat2 getTransformedUV(float2 offset, float2 scale, float rotation, float2 TextureUV)\0D\0A{\0D\0A    float3x3 MatTranslation = float3x3(1, 0, 0, 0, 1, 0, offset.x, offset.y, 1);\0D\0A    float3x3 MatRotation = float3x3(cos(rotation), sin(rotation), 0,\0D\0A                                -sin(rotation), cos(rotation), 0,\0D\0A                                0, 0, 1);\0D\0A    float3x3 MatScale = float3x3(scale.x, 0, 0, 0, scale.y, 0, 0, 0, 1);\0D\0A    float3x3 mat = mul(mul(MatTranslation, MatRotation), MatScale);\0D\0A    float2 transformedUV = mul(float3(TextureUV, 1), mat).xy;\0D\0A    return transformedUV;\0D\0A}"}
!96 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent\5CModel_VS.hlsl"}
!97 = !{!"-E", !"main", !"-T", !"vs_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!98 = !{i32 1, i32 3}
!99 = !{i32 1, i32 6}
!100 = !{!"vs", i32 6, i32 3}
!101 = !{null, null, !102, null}
!102 = !{!103, !104}
!103 = !{i32 0, %dx.alignment.legacy.PerBatchConstants* undef, !"PerBatchConstants", i32 0, i32 1, i32 1, i32 64, null}
!104 = !{i32 1, %dx.alignment.legacy.PerFrameConstants* undef, !"PerFrameConstants", i32 0, i32 2, i32 1, i32 160, null}
