#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xy  
; POSITION                 0   xyzw        1     NONE   float   xyzw
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 5b9f30c9c816f9ff03fd5141b5613dbd.pdb
; shader hash: 5b9f30c9c816f9ff03fd5141b5613dbd
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !54, globals: !143)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent\5CModel_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !32, !47}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 20, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 20, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 214, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 214, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 214, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 214, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 214, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!31, !13}
!31 = !DITemplateTypeParameter(name: "element", type: !14)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 24, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 24, size: 288, align: 32, elements: !34, templateParams: !44)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !33, file: !1, line: 24, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!44 = !{!12, !45, !46}
!45 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!46 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 22, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 22, size: 64, align: 32, elements: !49, templateParams: !52)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !{!12, !53}
!53 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!54 = !{!55, !64, !68, !71, !125, !128, !131, !134, !137, !140}
!55 = !DISubprogram(name: "main", scope: !1, file: !1, line: 135, type: !56, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!56 = !DISubroutineType(types: !57)
!57 = !{!15, !58}
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 61, size: 416, align: 32, elements: !59)
!59 = !{!60, !61, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectedPosition", scope: !58, file: !1, line: 63, baseType: !15, size: 128, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPosition", scope: !58, file: !1, line: 64, baseType: !15, size: 128, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "WorldNormal", scope: !58, file: !1, line: 65, baseType: !4, size: 96, align: 32, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "TextureUV", scope: !58, file: !1, line: 66, baseType: !47, size: 64, align: 32, offset: 352)
!64 = !DISubprogram(name: "getTransformedUV", linkageName: "\01?getTransformedUV@@YA?AV?$vector@M$01@@V1@0M0@Z", scope: !65, file: !65, line: 22, type: !66, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent/../Algorithm/CommonMath.hlsl", directory: "")
!66 = !DISubroutineType(types: !67)
!67 = !{!47, !47, !47, !8, !47}
!68 = !DISubprogram(name: "HomogeneousCoordinates", linkageName: "\01?HomogeneousCoordinates@@YA?AV?$vector@M$03@@V1@@Z", scope: !65, file: !65, line: 12, type: !69, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!15, !15}
!71 = !DISubprogram(name: "CalculateDirectionalLighting", linkageName: "\01?CalculateDirectionalLighting@@YA?AV?$vector@M$02@@USurfaceProperties@@UcLight@@@Z", scope: !1, file: !1, line: 92, type: !72, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!4, !74, !88}
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceProperties", file: !75, line: 13, size: 640, align: 32, elements: !76)
!75 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent/../Algorithm/Lighting.hlsl", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWorld", scope: !74, file: !75, line: 15, baseType: !15, size: 128, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Vec", scope: !74, file: !75, line: 16, baseType: !4, size: 96, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "View_Vec", scope: !74, file: !75, line: 17, baseType: !4, size: 96, align: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "N_dot_V", scope: !74, file: !75, line: 18, baseType: !8, size: 32, align: 32, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !74, file: !75, line: 19, baseType: !8, size: 32, align: 32, offset: 352)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "roughness_sq", scope: !74, file: !75, line: 20, baseType: !8, size: 32, align: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "roughness_mul_4", scope: !74, file: !75, line: 21, baseType: !8, size: 32, align: 32, offset: 416)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Albedo", scope: !74, file: !75, line: 23, baseType: !4, size: 96, align: 32, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !74, file: !75, line: 24, baseType: !8, size: 32, align: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !74, file: !75, line: 25, baseType: !8, size: 32, align: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientOcclusion", scope: !74, file: !75, line: 26, baseType: !8, size: 32, align: 32, offset: 608)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "cLight", file: !75, line: 54, size: 1664, align: 32, elements: !89)
!89 = !{!90, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "gLightViewMatrix", scope: !88, file: !75, line: 56, baseType: !91, size: 512, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 40, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 40, size: 512, align: 32, elements: !93, templateParams: !110)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !92, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!110 = !{!12, !111, !112}
!111 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!112 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "gLightProjectMatrix", scope: !88, file: !75, line: 57, baseType: !91, size: 512, align: 32, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "gLightPosition", scope: !88, file: !75, line: 58, baseType: !15, size: 128, align: 32, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "gLightColor", scope: !88, file: !75, line: 59, baseType: !15, size: 128, align: 32, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "gLightDirection", scope: !88, file: !75, line: 60, baseType: !15, size: 128, align: 32, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "gShadowMapIndex", scope: !88, file: !75, line: 61, baseType: !14, size: 32, align: 32, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gLightType", scope: !88, file: !75, line: 62, baseType: !14, size: 32, align: 32, offset: 1440)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "gInsensity", scope: !88, file: !75, line: 63, baseType: !8, size: 32, align: 32, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "conAngle", scope: !88, file: !75, line: 64, baseType: !8, size: 32, align: 32, offset: 1504)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "penumbraAngle", scope: !88, file: !75, line: 65, baseType: !8, size: 32, align: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "isCastShadow", scope: !88, file: !75, line: 66, baseType: !14, size: 32, align: 32, offset: 1568)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "lightIndex", scope: !88, file: !75, line: 67, baseType: !14, size: 32, align: 32, offset: 1600)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gDescriptorOffset", scope: !88, file: !75, line: 68, baseType: !14, size: 32, align: 32, offset: 1632)
!125 = !DISubprogram(name: "FresnalSchlick", linkageName: "\01?FresnalSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !75, file: !75, line: 102, type: !126, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !8, !4}
!128 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !75, file: !75, line: 112, type: !129, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!8, !4, !4, !8}
!131 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !75, file: !75, line: 135, type: !132, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!8, !4, !4, !4, !8}
!134 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !75, file: !75, line: 125, type: !135, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!8, !8, !8}
!137 = !DISubprogram(name: "CalculateIBL", linkageName: "\01?CalculateIBL@@YA?AV?$vector@M$02@@USurfaceProperties@@@Z", scope: !1, file: !1, line: 69, type: !138, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!138 = !DISubroutineType(types: !139)
!139 = !{!4, !74}
!140 = !DISubprogram(name: "FresnelSchlickRoughness", linkageName: "\01?FresnelSchlickRoughness@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !75, file: !75, line: 107, type: !141, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false)
!141 = !DISubroutineType(types: !142)
!142 = !{!4, !8, !4, !8}
!143 = !{!144, !146, !148, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !167, !168, !169, !170, !172, !173, !174, !175, !180, !181, !182, !186, !187, !188, !189, !190, !194, !195, !196, !202, !204, !205, !207, !209}
!144 = !DIGlobalVariable(name: "BaseColorFactor", linkageName: "\01?BaseColorFactor@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 19, type: !145, isLocal: false, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!146 = !DIGlobalVariable(name: "EmissiveFactor", linkageName: "\01?EmissiveFactor@cbMaterialConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 20, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!148 = !DIGlobalVariable(name: "NormalTextureScale", linkageName: "\01?NormalTextureScale@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 21, type: !149, isLocal: false, isDefinition: true)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!150 = !DIGlobalVariable(name: "MetallicRoughnessFactor", linkageName: "\01?MetallicRoughnessFactor@cbMaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 22, type: !151, isLocal: false, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!152 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@cbMaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 23, type: !151, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "BaseColorTextureTransform", linkageName: "\01?BaseColorTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 24, type: !145, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariable(name: "MetallicRoughnessTextureTransform", linkageName: "\01?MetallicRoughnessTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 25, type: !145, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "OcclusionTransform", linkageName: "\01?OcclusionTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 26, type: !145, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "EmissiveTextureTransform", linkageName: "\01?EmissiveTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 27, type: !145, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariable(name: "NormalTextureTransform", linkageName: "\01?NormalTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 28, type: !145, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "BaseColorRotation", linkageName: "\01?BaseColorRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 29, type: !149, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "MetallicRoughnessRotation", linkageName: "\01?MetallicRoughnessRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 30, type: !149, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariable(name: "OcclusionRotation", linkageName: "\01?OcclusionRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 31, type: !149, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariable(name: "EmissiveRotation", linkageName: "\01?EmissiveRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 32, type: !149, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "NormalRotation", linkageName: "\01?NormalRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 33, type: !149, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "depth_bias", linkageName: "\01?depth_bias@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 34, type: !149, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "padding1", linkageName: "\01?padding1@cbMaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 35, type: !151, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "gModelMatrix", linkageName: "\01?gModelMatrix@cbPerBatchConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 40, type: !166, isLocal: false, isDefinition: true)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!167 = !DIGlobalVariable(name: "gViewMatrix", linkageName: "\01?gViewMatrix@cbPerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 46, type: !166, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "gProjMatrix", linkageName: "\01?gProjMatrix@cbPerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 47, type: !166, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "gCameraPosition", linkageName: "\01?gCameraPosition@cbPerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 48, type: !145, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "gLightNum", linkageName: "\01?gLightNum@cbPerFrameConstants@@3HB", scope: !0, file: !1, line: 49, type: !171, isLocal: false, isDefinition: true)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!172 = !DIGlobalVariable(name: "clip_space_type", linkageName: "\01?clip_space_type@cbPerFrameConstants@@3HB", scope: !0, file: !1, line: 50, type: !171, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@cbPerFrameConstants@@3MB", scope: !0, file: !1, line: 51, type: !149, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@cbPerFrameConstants@@3MB", scope: !0, file: !1, line: 52, type: !149, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "glightinfo", linkageName: "\01?glightinfo@LightInfo@@3QBUcLight@@B", scope: !0, file: !1, line: 58, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 26624, align: 32, elements: !178)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!178 = !{!179}
!179 = !DISubrange(count: 16)
!180 = !DIGlobalVariable(name: "F0", scope: !0, file: !65, line: 1, type: !147, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariable(name: "PI", scope: !0, file: !65, line: 2, type: !149, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariable(name: "BaseColorTexture", linkageName: "\01?BaseColorTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !183, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?BaseColorTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!183 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 3, size: 160, align: 32, elements: !2, templateParams: !184)
!184 = !{!185}
!185 = !DITemplateTypeParameter(name: "element", type: !16)
!186 = !DIGlobalVariable(name: "MetallicRoughnessTexture", linkageName: "\01?MetallicRoughnessTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !183, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?MetallicRoughnessTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!187 = !DIGlobalVariable(name: "OcclusionTexture", linkageName: "\01?OcclusionTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !183, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariable(name: "EmissiveTexture", linkageName: "\01?EmissiveTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !183, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?EmissiveTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!189 = !DIGlobalVariable(name: "NormalTexture", linkageName: "\01?NormalTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !183, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariable(name: "RadianceIBLTexture", linkageName: "\01?RadianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 9, type: !191, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 3> >"* @"\01?RadianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A")
!191 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 3> >", file: !1, line: 9, size: 96, align: 32, elements: !2, templateParams: !192)
!192 = !{!193}
!193 = !DITemplateTypeParameter(name: "element", type: !5)
!194 = !DIGlobalVariable(name: "IrradianceIBLTexture", linkageName: "\01?IrradianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 10, type: !191, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 3> >"* @"\01?IrradianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A")
!195 = !DIGlobalVariable(name: "BRDF_LUT", linkageName: "\01?BRDF_LUT@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 11, type: !183, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?BRDF_LUT@@3V?$Texture2D@V?$vector@M$03@@@@A")
!196 = !DIGlobalVariable(name: "ShadowMaps", linkageName: "\01?ShadowMaps@@3PAV?$Texture2D@M@@A", scope: !0, file: !1, line: 13, type: !197, isLocal: false, isDefinition: true, variable: [100 x %"class.Texture2D<float>"]* @"\01?ShadowMaps@@3PAV?$Texture2D@M@@A")
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 6400, align: 32, elements: !200)
!198 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 213, size: 64, align: 32, elements: !2, templateParams: !199)
!199 = !{!12}
!200 = !{!201}
!201 = !DISubrange(count: 100)
!202 = !DIGlobalVariable(name: "DefaultSampler", linkageName: "\01?DefaultSampler@@3USamplerState@@A", scope: !0, file: !1, line: 15, type: !203, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?DefaultSampler@@3USamplerState@@A")
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 15, size: 32, align: 32, elements: !2)
!204 = !DIGlobalVariable(name: "MAX_LOD", scope: !137, file: !1, line: 82, type: !149, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariable(name: "F0.0", linkageName: "F0.0", scope: !0, file: !65, line: 1, type: !206, isLocal: false, isDefinition: true)
!206 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !147, size: 32, align: 4)
!207 = !DIGlobalVariable(name: "F0.2", linkageName: "F0.2", scope: !0, file: !65, line: 1, type: !208, isLocal: false, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !147, size: 32, align: 4, offset: 64)
!209 = !DIGlobalVariable(name: "F0.1", linkageName: "F0.1", scope: !0, file: !65, line: 1, type: !210, isLocal: false, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !147, size: 32, align: 4, offset: 32)
!211 = !{i32 2, !"Dwarf Version", i32 4}
!212 = !{i32 2, !"Debug Info Version", i32 3}
!213 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
