#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSITION                 0   xyzw        1     NONE   float   xyzw
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: a958310e07b87c69563a7e79bf00a18e.pdb
; shader hash: a958310e07b87c69563a7e79bf00a18e
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !60, globals: !149)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent\5CModel_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !32, !39, !54}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 20, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 20, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 216, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 216, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 216, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 216, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!30, !31}
!30 = !DITemplateTypeParameter(name: "element", type: !14)
!31 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 217, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 217, size: 96, align: 32, elements: !34, templateParams: !38)
!34 = !{!35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 217, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 217, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !33, file: !1, line: 217, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !{!30, !13}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 23, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 23, size: 288, align: 32, elements: !41, templateParams: !51)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !40, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!51 = !{!12, !52, !53}
!52 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!53 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 22, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 22, size: 64, align: 32, elements: !56, templateParams: !59)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !{!12, !31}
!60 = !{!61, !70, !74, !77, !131, !134, !137, !140, !143, !146}
!61 = !DISubprogram(name: "main", scope: !1, file: !1, line: 135, type: !62, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!62 = !DISubroutineType(types: !63)
!63 = !{!15, !64}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 61, size: 416, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectedPosition", scope: !64, file: !1, line: 63, baseType: !15, size: 128, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPosition", scope: !64, file: !1, line: 64, baseType: !15, size: 128, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "WorldNormal", scope: !64, file: !1, line: 65, baseType: !4, size: 96, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "TextureUV", scope: !64, file: !1, line: 66, baseType: !54, size: 64, align: 32, offset: 352)
!70 = !DISubprogram(name: "getTransformedUV", linkageName: "\01?getTransformedUV@@YA?AV?$vector@M$01@@V1@0M0@Z", scope: !71, file: !71, line: 21, type: !72, isLocal: false, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent/../Algorithm/CommonMath.hlsl", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!54, !54, !54, !8, !54}
!74 = !DISubprogram(name: "HomogeneousCoordinates", linkageName: "\01?HomogeneousCoordinates@@YA?AV?$vector@M$03@@V1@@Z", scope: !71, file: !71, line: 11, type: !75, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!15, !15}
!77 = !DISubprogram(name: "CalculateDirectionalLighting", linkageName: "\01?CalculateDirectionalLighting@@YA?AV?$vector@M$02@@USurfaceProperties@@UcLight@@@Z", scope: !1, file: !1, line: 92, type: !78, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!4, !80, !94}
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "SurfaceProperties", file: !81, line: 20, size: 640, align: 32, elements: !82)
!81 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CPresent/../Algorithm/Lighting.hlsl", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWorld", scope: !80, file: !81, line: 22, baseType: !15, size: 128, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Vec", scope: !80, file: !81, line: 23, baseType: !4, size: 96, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "View_Vec", scope: !80, file: !81, line: 24, baseType: !4, size: 96, align: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "N_dot_V", scope: !80, file: !81, line: 25, baseType: !8, size: 32, align: 32, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !80, file: !81, line: 26, baseType: !8, size: 32, align: 32, offset: 352)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "roughness_sq", scope: !80, file: !81, line: 27, baseType: !8, size: 32, align: 32, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "roughness_mul_4", scope: !80, file: !81, line: 28, baseType: !8, size: 32, align: 32, offset: 416)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Albedo", scope: !80, file: !81, line: 30, baseType: !4, size: 96, align: 32, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Metallic", scope: !80, file: !81, line: 31, baseType: !8, size: 32, align: 32, offset: 544)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Roughness", scope: !80, file: !81, line: 32, baseType: !8, size: 32, align: 32, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "AmbientOcclusion", scope: !80, file: !81, line: 33, baseType: !8, size: 32, align: 32, offset: 608)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "cLight", file: !81, line: 61, size: 1664, align: 32, elements: !95)
!95 = !{!96, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "gLightViewMatrix", scope: !94, file: !81, line: 63, baseType: !97, size: 512, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 40, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 40, size: 512, align: 32, elements: !99, templateParams: !116)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !98, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!116 = !{!12, !117, !118}
!117 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 4)
!118 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 4)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "gLightProjectMatrix", scope: !94, file: !81, line: 64, baseType: !97, size: 512, align: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "gLightPosition", scope: !94, file: !81, line: 65, baseType: !15, size: 128, align: 32, offset: 1024)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "gLightColor", scope: !94, file: !81, line: 66, baseType: !15, size: 128, align: 32, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gLightDirection", scope: !94, file: !81, line: 67, baseType: !15, size: 128, align: 32, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "gShadowMapIndex", scope: !94, file: !81, line: 68, baseType: !14, size: 32, align: 32, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gLightType", scope: !94, file: !81, line: 69, baseType: !14, size: 32, align: 32, offset: 1440)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "gInsensity", scope: !94, file: !81, line: 70, baseType: !8, size: 32, align: 32, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "conAngle", scope: !94, file: !81, line: 71, baseType: !8, size: 32, align: 32, offset: 1504)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "penumbraAngle", scope: !94, file: !81, line: 72, baseType: !8, size: 32, align: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "isCastShadow", scope: !94, file: !81, line: 73, baseType: !14, size: 32, align: 32, offset: 1568)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lightIndex", scope: !94, file: !81, line: 74, baseType: !14, size: 32, align: 32, offset: 1600)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "gDescriptorOffset", scope: !94, file: !81, line: 75, baseType: !14, size: 32, align: 32, offset: 1632)
!131 = !DISubprogram(name: "FresnalSchlick", linkageName: "\01?FresnalSchlick@@YA?AV?$vector@M$02@@MV1@@Z", scope: !81, file: !81, line: 109, type: !132, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!4, !8, !4}
!134 = !DISubprogram(name: "DistributionGGX", linkageName: "\01?DistributionGGX@@YAMV?$vector@M$02@@0M@Z", scope: !81, file: !81, line: 119, type: !135, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!135 = !DISubroutineType(types: !136)
!136 = !{!8, !4, !4, !8}
!137 = !DISubprogram(name: "GeometrySmith", linkageName: "\01?GeometrySmith@@YAMV?$vector@M$02@@00M@Z", scope: !81, file: !81, line: 142, type: !138, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false)
!138 = !DISubroutineType(types: !139)
!139 = !{!8, !4, !4, !4, !8}
!140 = !DISubprogram(name: "GeometrySchlickGGX", linkageName: "\01?GeometrySchlickGGX@@YAMMM@Z", scope: !81, file: !81, line: 132, type: !141, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false)
!141 = !DISubroutineType(types: !142)
!142 = !{!8, !8, !8}
!143 = !DISubprogram(name: "CalculateIBL", linkageName: "\01?CalculateIBL@@YA?AV?$vector@M$02@@USurfaceProperties@@@Z", scope: !1, file: !1, line: 69, type: !144, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!144 = !DISubroutineType(types: !145)
!145 = !{!4, !80}
!146 = !DISubprogram(name: "FresnelSchlickRoughness", linkageName: "\01?FresnelSchlickRoughness@@YA?AV?$vector@M$02@@MV1@M@Z", scope: !81, file: !81, line: 114, type: !147, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false)
!147 = !DISubroutineType(types: !148)
!148 = !{!4, !8, !4, !8}
!149 = !{!150, !152, !154, !156, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !173, !174, !175, !176, !178, !179, !180, !181, !186, !187, !191, !192, !193, !194, !195, !199, !200, !201, !204, !206, !207, !209, !211}
!150 = !DIGlobalVariable(name: "BaseColorFactor", linkageName: "\01?BaseColorFactor@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 19, type: !151, isLocal: false, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!152 = !DIGlobalVariable(name: "EmissiveFactor", linkageName: "\01?EmissiveFactor@cbMaterialConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 20, type: !153, isLocal: false, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!154 = !DIGlobalVariable(name: "NormalTextureScale", linkageName: "\01?NormalTextureScale@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 21, type: !155, isLocal: false, isDefinition: true)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!156 = !DIGlobalVariable(name: "MetallicRoughnessFactor", linkageName: "\01?MetallicRoughnessFactor@cbMaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 22, type: !157, isLocal: false, isDefinition: true)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!158 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@cbMaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 23, type: !157, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "BaseColorTextureTransform", linkageName: "\01?BaseColorTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 24, type: !151, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariable(name: "MetallicRoughnessTextureTransform", linkageName: "\01?MetallicRoughnessTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 25, type: !151, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariable(name: "OcclusionTransform", linkageName: "\01?OcclusionTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 26, type: !151, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariable(name: "EmissiveTextureTransform", linkageName: "\01?EmissiveTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 27, type: !151, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariable(name: "NormalTextureTransform", linkageName: "\01?NormalTextureTransform@cbMaterialConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 28, type: !151, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariable(name: "BaseColorRotation", linkageName: "\01?BaseColorRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 29, type: !155, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "MetallicRoughnessRotation", linkageName: "\01?MetallicRoughnessRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 30, type: !155, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "OcclusionRotation", linkageName: "\01?OcclusionRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 31, type: !155, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariable(name: "EmissiveRotation", linkageName: "\01?EmissiveRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 32, type: !155, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "NormalRotation", linkageName: "\01?NormalRotation@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 33, type: !155, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "depth_bias", linkageName: "\01?depth_bias@cbMaterialConstants@@3MB", scope: !0, file: !1, line: 34, type: !155, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "padding1", linkageName: "\01?padding1@cbMaterialConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 35, type: !157, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariable(name: "gModelMatrix", linkageName: "\01?gModelMatrix@cbPerBatchConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 40, type: !172, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!173 = !DIGlobalVariable(name: "gViewMatrix", linkageName: "\01?gViewMatrix@cbPerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 46, type: !172, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "gProjMatrix", linkageName: "\01?gProjMatrix@cbPerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 47, type: !172, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "gCameraPosition", linkageName: "\01?gCameraPosition@cbPerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 48, type: !151, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "gLightNum", linkageName: "\01?gLightNum@cbPerFrameConstants@@3HB", scope: !0, file: !1, line: 49, type: !177, isLocal: false, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!178 = !DIGlobalVariable(name: "clip_space_type", linkageName: "\01?clip_space_type@cbPerFrameConstants@@3HB", scope: !0, file: !1, line: 50, type: !177, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@cbPerFrameConstants@@3MB", scope: !0, file: !1, line: 51, type: !155, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@cbPerFrameConstants@@3MB", scope: !0, file: !1, line: 52, type: !155, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariable(name: "glightinfo", linkageName: "\01?glightinfo@LightInfo@@3QBUcLight@@B", scope: !0, file: !1, line: 58, type: !182, isLocal: false, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 166400, align: 32, elements: !184)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!184 = !{!185}
!185 = !DISubrange(count: 100)
!186 = !DIGlobalVariable(name: "F0", scope: !0, file: !81, line: 9, type: !153, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariable(name: "BaseColorTexture", linkageName: "\01?BaseColorTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !188, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?BaseColorTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!188 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 3, size: 160, align: 32, elements: !2, templateParams: !189)
!189 = !{!190}
!190 = !DITemplateTypeParameter(name: "element", type: !16)
!191 = !DIGlobalVariable(name: "MetallicRoughnessTexture", linkageName: "\01?MetallicRoughnessTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 4, type: !188, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?MetallicRoughnessTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!192 = !DIGlobalVariable(name: "OcclusionTexture", linkageName: "\01?OcclusionTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 5, type: !188, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariable(name: "EmissiveTexture", linkageName: "\01?EmissiveTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 6, type: !188, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?EmissiveTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!194 = !DIGlobalVariable(name: "NormalTexture", linkageName: "\01?NormalTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 7, type: !188, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariable(name: "RadianceIBLTexture", linkageName: "\01?RadianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 9, type: !196, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 3> >"* @"\01?RadianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A")
!196 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 3> >", file: !1, line: 9, size: 96, align: 32, elements: !2, templateParams: !197)
!197 = !{!198}
!198 = !DITemplateTypeParameter(name: "element", type: !5)
!199 = !DIGlobalVariable(name: "IrradianceIBLTexture", linkageName: "\01?IrradianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A", scope: !0, file: !1, line: 10, type: !196, isLocal: false, isDefinition: true, variable: %"class.TextureCube<vector<float, 3> >"* @"\01?IrradianceIBLTexture@@3V?$TextureCube@V?$vector@M$02@@@@A")
!200 = !DIGlobalVariable(name: "BRDF_LUT", linkageName: "\01?BRDF_LUT@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 11, type: !188, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?BRDF_LUT@@3V?$Texture2D@V?$vector@M$03@@@@A")
!201 = !DIGlobalVariable(name: "ShadowMaps", linkageName: "\01?ShadowMaps@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 13, type: !202, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?ShadowMaps@@3V?$Texture2D@M@@A")
!202 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 13, size: 64, align: 32, elements: !2, templateParams: !203)
!203 = !{!12}
!204 = !DIGlobalVariable(name: "DefaultSampler", linkageName: "\01?DefaultSampler@@3USamplerState@@A", scope: !0, file: !1, line: 15, type: !205, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?DefaultSampler@@3USamplerState@@A")
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 15, size: 32, align: 32, elements: !2)
!206 = !DIGlobalVariable(name: "MAX_LOD", scope: !143, file: !1, line: 82, type: !155, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariable(name: "F0.2", linkageName: "F0.2", scope: !0, file: !81, line: 9, type: !208, isLocal: false, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !153, size: 32, align: 4, offset: 64)
!209 = !DIGlobalVariable(name: "F0.0", linkageName: "F0.0", scope: !0, file: !81, line: 9, type: !210, isLocal: false, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !153, size: 32, align: 4)
!211 = !DIGlobalVariable(name: "F0.1", linkageName: "F0.1", scope: !0, file: !81, line: 9, type: !212, isLocal: false, isDefinition: true)
!212 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !153, size: 32, align: 4, offset: 32)
!213 = !{i32 2, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
