#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEX                      0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 6b363b2a89addc7e0cc6a479ac3305b4.pdb
; shader hash: 6b363b2a89addc7e0cc6a479ac3305b4
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEX                      0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer SeaSubParams
; {
;
;   struct SeaSubParams
;   {
;
;       float2 _Mouse;                                ; Offset:    0
;       float2 _ScreenSize;                           ; Offset:    8
;       float _Time;                                  ; Offset:   16

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !96)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5COverlay\5CSeaSub_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 18, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 18, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 18, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 15, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 15, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !39, !42, !45, !63, !68, !71, !74, !77, !78, !81, !82, !85, !88, !91, !94}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 231, type: !33, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "PresentOut", file: !1, line: 7, size: 192, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !35, file: !1, line: 9, baseType: !4, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "texUV", scope: !35, file: !1, line: 10, baseType: !24, size: 64, align: 32, offset: 128)
!39 = !DISubprogram(name: "??__ESEA_WATER_COLOR@@YAXXZ", scope: !1, file: !1, line: 37, type: !40, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{null}
!42 = !DISubprogram(name: "getPixel", linkageName: "\01?getPixel@@YA?AV?$vector@M$02@@V?$vector@M$01@@M@Z", scope: !1, file: !1, line: 202, type: !43, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!16, !24, !8}
!45 = !DISubprogram(name: "fromEuler", linkageName: "\01?fromEuler@@YA?AV?$matrix@M$02$02@@V?$vector@M$02@@@Z", scope: !1, file: !1, line: 42, type: !46, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !16}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 228, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 228, size: 288, align: 32, elements: !50, templateParams: !60)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 228, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !{!13, !61, !62}
!61 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!62 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!63 = !DISubprogram(name: "heightMapTracing", linkageName: "\01?heightMapTracing@@YAMV?$vector@M$02@@0AIAV1@@Z", scope: !1, file: !1, line: 170, type: !64, isLocal: false, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!8, !16, !16, !66}
!66 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!68 = !DISubprogram(name: "map", linkageName: "\01?map@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 97, type: !69, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!8, !16}
!71 = !DISubprogram(name: "sea_octave", linkageName: "\01?sea_octave@@YAMV?$vector@M$01@@M@Z", scope: !1, file: !1, line: 88, type: !72, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!8, !24, !8}
!74 = !DISubprogram(name: "noise", linkageName: "\01?noise@@YAMV?$vector@M$01@@@Z", scope: !1, file: !1, line: 58, type: !75, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!8, !24}
!77 = !DISubprogram(name: "hash", linkageName: "\01?hash@@YAMV?$vector@M$01@@@Z", scope: !1, file: !1, line: 53, type: !75, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubprogram(name: "getNormal", linkageName: "\01?getNormal@@YA?AV?$vector@M$02@@V1@M@Z", scope: !1, file: !1, line: 160, type: !79, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{!16, !16, !8}
!81 = !DISubprogram(name: "map_detailed", linkageName: "\01?map_detailed@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 119, type: !69, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubprogram(name: "getSeaColor", linkageName: "\01?getSeaColor@@YA?AV?$vector@M$02@@V1@0000@Z", scope: !1, file: !1, line: 141, type: !83, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!16, !16, !16, !16, !16, !16}
!85 = !DISubprogram(name: "diffuse", linkageName: "\01?diffuse@@YAMV?$vector@M$02@@0M@Z", scope: !1, file: !1, line: 70, type: !86, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false)
!86 = !DISubroutineType(types: !87)
!87 = !{!8, !16, !16, !8}
!88 = !DISubprogram(name: "specular", linkageName: "\01?specular@@YAMV?$vector@M$02@@00M@Z", scope: !1, file: !1, line: 74, type: !89, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!8, !16, !16, !16, !8}
!91 = !DISubprogram(name: "getSkyColor", linkageName: "\01?getSkyColor@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 81, type: !92, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!16, !16}
!94 = !DISubprogram(linkageName: "_GLOBAL__sub_I_SeaSub_PS.hlsl", scope: !1, file: !1, type: !95, isLocal: true, isDefinition: true, flags: DIFlagArtificial, isOptimized: false)
!95 = !DISubroutineType(types: !2)
!96 = !{!97, !99, !100, !102, !104, !108, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!97 = !DIGlobalVariable(name: "_Mouse", linkageName: "\01?_Mouse@SeaSubParams@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 15, type: !98, isLocal: false, isDefinition: true)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!99 = !DIGlobalVariable(name: "_ScreenSize", linkageName: "\01?_ScreenSize@SeaSubParams@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 16, type: !98, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariable(name: "_Time", linkageName: "\01?_Time@SeaSubParams@@3MB", scope: !0, file: !1, line: 17, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!102 = !DIGlobalVariable(name: "_padding0", linkageName: "\01?_padding0@SeaSubParams@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 18, type: !103, isLocal: false, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!104 = !DIGlobalVariable(name: "PresentMap", linkageName: "\01?PresentMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 21, type: !105, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 21, size: 160, align: 32, elements: !2, templateParams: !106)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "element", type: !5)
!108 = !DIGlobalVariable(name: "NUM_STEPS", scope: !0, file: !1, line: 23, type: !109, isLocal: true, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!110 = !DIGlobalVariable(name: "PI", scope: !0, file: !1, line: 24, type: !101, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariable(name: "EPSILON", scope: !0, file: !1, line: 25, type: !101, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariable(name: "ITER_GEOMETRY", scope: !0, file: !1, line: 30, type: !109, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariable(name: "ITER_FRAGMENT", scope: !0, file: !1, line: 31, type: !109, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariable(name: "SEA_HEIGHT", scope: !0, file: !1, line: 32, type: !101, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariable(name: "SEA_CHOPPY", scope: !0, file: !1, line: 33, type: !101, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariable(name: "SEA_SPEED", scope: !0, file: !1, line: 34, type: !101, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariable(name: "SEA_FREQ", scope: !0, file: !1, line: 35, type: !101, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariable(name: "SEA_BASE", scope: !0, file: !1, line: 36, type: !103, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariable(name: "SEA_WATER_COLOR", scope: !0, file: !1, line: 37, type: !103, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariable(name: "octave_m", linkageName: "octave_m.v.v", scope: !0, file: !1, line: 39, type: !121, isLocal: false, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2x2", file: !1, line: 39, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 2, 2>", file: !1, line: 39, size: 128, align: 32, elements: !124, templateParams: !129)
!124 = !{!125, !126, !127, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !123, file: !1, line: 39, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !123, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !123, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !123, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!129 = !{!13, !130, !131}
!130 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 2)
!131 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 2)
!132 = !{i32 2, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
