#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 3   xyz         1     NONE   float   xyz 
;
; shader debug name: 0414bd85aad459c6fa1fdad7bef2b3c8.pdb
; shader hash: 0414bd85aad459c6fa1fdad7bef2b3c8
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 3                 linear       
;
; Buffer Definitions:
;
; cbuffer VSConstants
; {
;
;   struct dx.alignment.legacy.VSConstants
;   {
;
;       column_major float4x4 ProjInverse;            ; Offset:    0
;       column_major float3x3 ViewInverse;            ; Offset:   64
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !48)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CSkyBox\5CSkyBox_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 15, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 15, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 15, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 15, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 15, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 15, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 4, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 4, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 13, type: !33, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !47}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 7, size: 224, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !35, file: !1, line: 9, baseType: !22, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "viewDir", scope: !35, file: !1, line: 10, baseType: !39, size: 96, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 4, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 4, size: 96, align: 32, elements: !41, templateParams: !45)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !40, file: !1, line: 4, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !40, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !40, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!11, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 4, baseType: !18)
!48 = !{!49, !73}
!49 = !DIGlobalVariable(name: "ProjInverse", linkageName: "\01?ProjInverse@VSConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !53, templateParams: !70)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !52, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!70 = !{!11, !71, !72}
!71 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!72 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!73 = !DIGlobalVariable(name: "ViewInverse", linkageName: "\01?ViewInverse@VSConstants@@3V?$matrix@M$02$02@@B", scope: !0, file: !1, line: 4, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 4, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 4, size: 288, align: 32, elements: !77, templateParams: !87)
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !76, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!87 = !{!11, !88, !89}
!88 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 3)
!89 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 3)
!90 = !{i32 2, !"Dwarf Version", i32 4}
!91 = !{i32 2, !"Debug Info Version", i32 3}
!92 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!93 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CSkyBox\5CSkyBox_VS.hlsl", !"cbuffer VSConstants : register(b0)\0D\0A{\0D\0A    float4x4 ProjInverse;\0D\0A    float3x3 ViewInverse;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float3 viewDir : TEXCOORD3;\0D\0A};\0D\0A\0D\0AVSOutput main(uint VertID : SV_VertexID)\0D\0A{\0D\0A    float2 ScreenUV = float2(uint2(VertID, VertID << 1) & 2);\0D\0A    float4 ProjectedPos = float4(lerp(float2(-1, 1), float2(1, -1), ScreenUV), 1, 1);\0D\0A    float4 PosViewSpace = mul(ProjInverse, ProjectedPos);\0D\0A\0D\0A    VSOutput vsOutput;\0D\0A    vsOutput.position = ProjectedPos;\0D\0A    vsOutput.viewDir = mul(ViewInverse, PosViewSpace.xyz / PosViewSpace.w);\0D\0A\0D\0A    return vsOutput;\0D\0A}\0D\0A"}
!94 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CSkyBox\5CSkyBox_VS.hlsl"}
!95 = !{!"-E", !"main", !"-T", !"vs_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!96 = !{i32 1, i32 3}
!97 = !{i32 1, i32 6}
!98 = !{!"vs", i32 6, i32 3}
!99 = !{null, null, !100, null}
!100 = !{!101}
!101 = !{i32 0, %dx.alignment.legacy.VSConstants* undef, !"VSConstants", i32 0, i32 0, i32 1, i32 108, null}
!102 = !{i32 0, %struct.VSOutput undef, !103, %VSConstants undef, !106, %dx.alignment.legacy.VSConstants undef, !106}
!103 = !{i32 28, !104, !105}
!104 = !{i32 6, !"position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!105 = !{i32 6, !"viewDir", i32 3, i32 16, i32 4, !"TEXCOORD3", i32 7, i32 9}
!106 = !{i32 108, !107, !109}
!107 = !{i32 6, !"ProjInverse", i32 2, !108, i32 3, i32 0, i32 7, i32 9}
!108 = !{i32 4, i32 4, i32 2}
!109 = !{i32 6, !"ViewInverse", i32 2, !110, i32 3, i32 64, i32 7, i32 9}
!110 = !{i32 3, i32 3, i32 2}
!111 = !{i32 1, void ()* @main, !112}
!112 = !{!113}
!113 = !{i32 0, !2, !2}
!114 = !{[3 x i32] [i32 1, i32 7, i32 115]}
!115 = !{void ()* @main, !"main", !116, !99, !127}
!116 = !{!117, !121, null}
!117 = !{!118}
!118 = !{i32 0, !"SV_VertexID", i8 5, i8 1, !119, i8 0, i32 1, i8 1, i32 0, i8 0, !120}
!119 = !{i32 0}
!120 = !{i32 3, i32 1}
!121 = !{!122, !124}
!122 = !{i32 0, !"SV_Position", i8 9, i8 3, !119, i8 4, i32 1, i8 4, i32 0, i8 0, !123}
!123 = !{i32 3, i32 15}
!124 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !125, i8 2, i32 1, i8 3, i32 1, i8 0, !126}
!125 = !{i32 3}
!126 = !{i32 3, i32 7}
!127 = !{i32 0, i64 1}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "VertID", arg: 1, scope: !32, file: !1, line: 13, type: !47)
!129 = !DIExpression()
!130 = !DILocation(line: 13, column: 20, scope: !32)
!131 = !DILocation(line: 15, column: 51, scope: !32)
!132 = !DILocation(line: 15, column: 57, scope: !32)
!133 = !DILocation(line: 15, column: 30, scope: !32)
!134 = !DILocation(line: 15, column: 12, scope: !32)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ScreenUV", scope: !32, file: !1, line: 15, type: !4)
!136 = !DIExpression(DW_OP_bit_piece, 0, 32)
!137 = !DIExpression(DW_OP_bit_piece, 32, 32)
!138 = !DILocation(line: 16, column: 34, scope: !32)
!139 = !DILocation(line: 16, column: 12, scope: !32)
!140 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ProjectedPos", scope: !32, file: !1, line: 16, type: !22)
!141 = !DIExpression(DW_OP_bit_piece, 64, 32)
!142 = !DIExpression(DW_OP_bit_piece, 96, 32)
!143 = !DILocation(line: 17, column: 31, scope: !32)
!144 = !DILocation(line: 17, column: 27, scope: !32)
!145 = !DILocation(line: 17, column: 12, scope: !32)
