#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyzw        1     NONE   float   xyzw
; NORMAL                   0   xyz         2     NONE   float   xyz 
; TEXCOORD                 0   xy          3     NONE   float   xy  
;
; shader debug name: fda0ee7a988df8a2f42e18f26c482779.pdb
; shader hash: fda0ee7a988df8a2f42e18f26c482779
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !46)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CShadow\5CSpotLight_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 12, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 12, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 31, type: !18, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !41}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 23, size: 416, align: 32, elements: !21)
!21 = !{!22, !23, !24, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectedPosition", scope: !20, file: !1, line: 25, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPosition", scope: !20, file: !1, line: 26, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "WorldNormal", scope: !20, file: !1, line: 27, baseType: !25, size: 96, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 12, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 12, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "TextureUV", scope: !20, file: !1, line: 28, baseType: !34, size: 64, align: 32, offset: 352)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 12, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 12, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexIn", file: !1, line: 16, size: 256, align: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !41, file: !1, line: 18, baseType: !25, size: 96, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !41, file: !1, line: 19, baseType: !25, size: 96, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Tex", scope: !41, file: !1, line: 20, baseType: !34, size: 64, align: 32, offset: 192)
!46 = !{!47, !71, !72, !73}
!47 = !DIGlobalVariable(name: "gModelMatrix", linkageName: "\01?gModelMatrix@Spot_Light_Batch@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !51, templateParams: !68)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !50, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!68 = !{!13, !69, !70}
!69 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!70 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!71 = !DIGlobalVariable(name: "gViewMatrix", linkageName: "\01?gViewMatrix@Spot_Light_Frame@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 10, type: !48, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gProjMatrix", linkageName: "\01?gProjMatrix@Spot_Light_Frame@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 11, type: !48, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "gLightPos", linkageName: "\01?gLightPos@Spot_Light_Frame@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 12, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!78 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CShadow\5CSpotLight_VS.hlsl", !"\0D\0A\0D\0Acbuffer Spot_Light_Batch : register(b1)\0D\0A{\0D\0A    float4x4 gModelMatrix;\0D\0A};\0D\0A\0D\0Acbuffer Spot_Light_Frame : register(b2)\0D\0A{\0D\0A    float4x4 gViewMatrix;\0D\0A    float4x4 gProjMatrix;\0D\0A    float4 gLightPos;\0D\0A    \0D\0A};\0D\0A\0D\0Astruct VertexIn\0D\0A{\0D\0A    float3 Position : POSITION;\0D\0A    float3 Normal : NORMAL;\0D\0A    float2 Tex : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexOut\0D\0A{\0D\0A    float4 ProjectedPosition : SV_POSITION;\0D\0A    float4 WorldPosition : POSITION;\0D\0A    float3 WorldNormal : NORMAL;\0D\0A    float2 TextureUV : TEXCOORD;\0D\0A};\0D\0A\0D\0AVertexOut main(VertexIn vin)\0D\0A{\0D\0A    VertexOut vout;\0D\0A    float4x4 ProjectedMat = transpose(mul(gProjMatrix, gViewMatrix)); // V^T * P^T = (P * V)^T\0D\0A\0D\0A    vout.WorldPosition = mul(float4(vin.Position, 1.0f), gModelMatrix); // X * M = Xworld\0D\0A    vout.ProjectedPosition = mul(vout.WorldPosition, ProjectedMat); // X*M*V*P = Xworld * (P * V)^ T\0D\0A    vout.WorldNormal = mul(float4(vin.Normal, 0.0f), gModelMatrix).xyz;\0D\0A    vout.TextureUV = vin.Tex;\0D\0A    return vout;\0D\0A}"}
!79 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CShadow\5CSpotLight_VS.hlsl"}
!80 = !{!"-E", !"main", !"-T", !"vs_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!81 = !{i32 1, i32 3}
!82 = !{i32 1, i32 6}
!83 = !{!"vs", i32 6, i32 3}
!84 = !{null, null, !85, null}
!85 = !{!86, !87}
!86 = !{i32 0, %dx.alignment.legacy.Spot_Light_Batch* undef, !"Spot_Light_Batch", i32 0, i32 1, i32 1, i32 64, null}
!87 = !{i32 1, %dx.alignment.legacy.Spot_Light_Frame* undef, !"Spot_Light_Frame", i32 0, i32 2, i32 1, i32 144, null}
!88 = !{i32 0, %struct.VertexOut undef, !89, %struct.VertexIn undef, !94, %Spot_Light_Batch undef, !98, %Spot_Light_Frame undef, !101, %dx.alignment.legacy.Spot_Light_Batch undef, !98, %dx.alignment.legacy.Spot_Light_Frame undef, !101}
!89 = !{i32 56, !90, !91, !92, !93}
!90 = !{i32 6, !"ProjectedPosition", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!91 = !{i32 6, !"WorldPosition", i32 3, i32 16, i32 4, !"POSITION", i32 7, i32 9}
!92 = !{i32 6, !"WorldNormal", i32 3, i32 32, i32 4, !"NORMAL", i32 7, i32 9}
!93 = !{i32 6, !"TextureUV", i32 3, i32 48, i32 4, !"TEXCOORD", i32 7, i32 9}
!94 = !{i32 40, !95, !96, !97}
!95 = !{i32 6, !"Position", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!96 = !{i32 6, !"Normal", i32 3, i32 16, i32 4, !"NORMAL", i32 7, i32 9}
!97 = !{i32 6, !"Tex", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!98 = !{i32 64, !99}
!99 = !{i32 6, !"gModelMatrix", i32 2, !100, i32 3, i32 0, i32 7, i32 9}
!100 = !{i32 4, i32 4, i32 2}
!101 = !{i32 144, !102, !103, !104}
!102 = !{i32 6, !"gViewMatrix", i32 2, !100, i32 3, i32 0, i32 7, i32 9}
