#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float     zw
; POSITION                 0   xyzw        1     NONE   float       
; NORMAL                   0   xyz         2     NONE   float       
; TEXCOORD                 0   xy          3     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 4be78c4dc148477ec44dba1dcbfe0693.pdb
; shader hash: 4be78c4dc148477ec44dba1dcbfe0693
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !41)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CShadow\5CSpotLight_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 15, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 15, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 36, type: !18, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 28, size: 416, align: 32, elements: !21)
!21 = !{!22, !23, !24, !33}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ProjectedPosition", scope: !20, file: !1, line: 30, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPosition", scope: !20, file: !1, line: 31, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "WorldNormal", scope: !20, file: !1, line: 32, baseType: !25, size: 96, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 18, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 18, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "TextureUV", scope: !20, file: !1, line: 33, baseType: !34, size: 64, align: 32, offset: 352)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 18, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 18, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !{!42, !66, !67, !68, !70, !72, !73, !75, !79}
!42 = !DIGlobalVariable(name: "gModelMatrix", linkageName: "\01?gModelMatrix@Spot_Light_Batch@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 8, type: !43, isLocal: false, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 8, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 8, size: 512, align: 32, elements: !46, templateParams: !63)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !45, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!63 = !{!13, !64, !65}
!64 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!65 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!66 = !DIGlobalVariable(name: "gViewMatrix", linkageName: "\01?gViewMatrix@Spot_Light_Frame@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 13, type: !43, isLocal: false, isDefinition: true)
!67 = !DIGlobalVariable(name: "gProjMatrix", linkageName: "\01?gProjMatrix@Spot_Light_Frame@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 14, type: !43, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "gLightPos", linkageName: "\01?gLightPos@Spot_Light_Frame@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 15, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!70 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@Spot_Light_Frame@@3MB", scope: !0, file: !1, line: 16, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!72 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@Spot_Light_Frame@@3MB", scope: !0, file: !1, line: 17, type: !71, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@Spot_Light_Frame@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 18, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!75 = !DIGlobalVariable(name: "ShadowMap", linkageName: "\01?ShadowMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 3, type: !76, isLocal: false, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 3, size: 160, align: 32, elements: !2, templateParams: !77)
!77 = !{!78}
!78 = !DITemplateTypeParameter(name: "element", type: !5)
!79 = !DIGlobalVariable(name: "DefaultSampler", linkageName: "\01?DefaultSampler@@3USamplerState@@A", scope: !0, file: !1, line: 4, type: !80, isLocal: false, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 4, size: 32, align: 32, elements: !2)
!81 = !{i32 2, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!84 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CShadow\5CSpotLight_PS.hlsl", !"\0D\0A\0D\0ATexture2D<float4> ShadowMap : register(t0);\0D\0ASamplerState DefaultSampler : register(s10);\0D\0A\0D\0Acbuffer Spot_Light_Batch : register(b1)\0D\0A{\0D\0A    float4x4 gModelMatrix;\0D\0A};\0D\0A\0D\0Acbuffer Spot_Light_Frame : register(b2)\0D\0A{\0D\0A    float4x4 gViewMatrix;\0D\0A    float4x4 gProjMatrix;\0D\0A    float4 gLightPos;\0D\0A    float gScreenWidth;\0D\0A    float gScreenHeight;\0D\0A    float2 padding0;\0D\0A};\0D\0A\0D\0A//struct VertexIn\0D\0A//{\0D\0A//    float3 Position : POSITION;\0D\0A//    float3 Normal : NORMAL;\0D\0A//    float2 Tex : TEXCOORD;\0D\0A//};\0D\0A\0D\0Astruct VertexOut\0D\0A{\0D\0A    float4 ProjectedPosition : SV_POSITION;\0D\0A    float4 WorldPosition : POSITION;\0D\0A    float3 WorldNormal : NORMAL;\0D\0A    float2 TextureUV : TEXCOORD;\0D\0A};\0D\0A\0D\0Afloat4 main(VertexOut pin) : SV_Target\0D\0A{\0D\0A    //float2 uv = float2(pin.ProjectedPosition.x / gScreenWidth, pin.ProjectedPosition.y / gScreenHeight);\0D\0A    float4 projPos = pin.ProjectedPosition / pin.ProjectedPosition.w;\0D\0A    float4 color = float4(1 - projPos.z, 1 - projPos.z, 1 - projPos.z, 1.0f);\0D\0A    return color;\0D\0A}"}
!85 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CShadow\5CSpotLight_PS.hlsl"}
!86 = !{!"-E", !"main", !"-T", !"ps_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!87 = !{i32 1, i32 3}
!88 = !{i32 1, i32 6}
!89 = !{!"ps", i32 6, i32 3}
