#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyzw        1     NONE   float   xyzw
; TEX                      0   xy          2     NONE   float   xy  
;
; shader debug name: e73238383bdd52ffe9965f1573ecbd5c.pdb
; shader hash: e73238383bdd52ffe9965f1573ecbd5c
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; TEX                      0                 linear       
;
; Buffer Definitions:
;
; cbuffer VolumetricLightConstants
; {
;
;   struct dx.alignment.legacy.VolumetricLightConstants
;   {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !40, globals: !50)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 11, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 11, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 11, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 25, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 25, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 25, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 25, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 27, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 27, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 27, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 27, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 27, baseType: !13, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!29, !30}
!29 = !DITemplateTypeParameter(name: "element", type: !13)
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 4, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 4, size: 128, align: 32, elements: !33, templateParams: !38)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 4, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !32, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!38 = !{!11, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!40 = !{!41}
!41 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !42, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !49}
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "VolumetricLightVSOut", file: !1, line: 16, size: 320, align: 32, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !44, file: !1, line: 18, baseType: !31, size: 128, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "positionCS", scope: !44, file: !1, line: 19, baseType: !31, size: 128, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "texUV", scope: !44, file: !1, line: 20, baseType: !4, size: 64, align: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 11, baseType: !18)
!50 = !{!51, !75, !77, !79, !80, !81, !82, !83, !84, !86}
!51 = !DIGlobalVariable(name: "gInvViewProj", linkageName: "\01?gInvViewProj@VolumetricLightConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !55, templateParams: !72)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !54, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!72 = !{!11, !73, !74}
!73 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!74 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!75 = !DIGlobalVariable(name: "gCameraPos", linkageName: "\01?gCameraPos@VolumetricLightConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 4, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!77 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 5, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!79 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 6, type: !78, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariable(name: "gMarchingStep", linkageName: "\01?gMarchingStep@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 7, type: !78, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "gSampleIntensity", linkageName: "\01?gSampleIntensity@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 8, type: !78, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "gCameraNearZ", linkageName: "\01?gCameraNearZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 9, type: !78, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "gCameraFarZ", linkageName: "\01?gCameraFarZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 10, type: !78, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@VolumetricLightConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 11, type: !85, isLocal: false, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!86 = !DIGlobalVariable(name: "gCameraDepthMap", linkageName: "\01?gCameraDepthMap@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 14, type: !87, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?gCameraDepthMap@@3V?$Texture2D@M@@A")
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 14, size: 64, align: 32, elements: !2, templateParams: !88)
!88 = !{!11}
!89 = !{i32 2, !"Dwarf Version", i32 4}
!90 = !{i32 2, !"Debug Info Version", i32 3}
!91 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!92 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_VS.hlsl", !"cbuffer VolumetricLightConstants : register(b1)\0D\0A{\0D\0A    float4x4 gInvViewProj;\0D\0A    float4 gCameraPos;\0D\0A    float gScreenWidth;\0D\0A    float gScreenHeight;\0D\0A    float gMarchingStep;\0D\0A    float gSampleIntensity;\0D\0A    float gCameraNearZ;\0D\0A    float gCameraFarZ;\0D\0A    float2 padding0;\0D\0A};\0D\0A\0D\0ATexture2D<float> gCameraDepthMap : register(t0);\0D\0A\0D\0Astruct VolumetricLightVSOut\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float4 positionCS : POSITION;\0D\0A    float2 texUV : TEX;\0D\0A};\0D\0A\0D\0AVolumetricLightVSOut main(uint VertID : SV_VertexID)\0D\0A{\0D\0A    float2 ScreenUV = float2(uint2(VertID, VertID << 1) & 2);\0D\0A    float2 texUV = lerp(float2(-1, 1), float2(1, -1), ScreenUV);\0D\0A    float depth = gCameraDepthMap.Load(int3(ScreenUV.x * gScreenWidth, ScreenUV.y * gScreenHeight, 0));\0D\0A    VolumetricLightVSOut volumetricLightVSOut;\0D\0A    volumetricLightVSOut.position = float4(texUV, 0, 1);\0D\0A    volumetricLightVSOut.positionCS = float4(texUV, depth, 1);\0D\0A    volumetricLightVSOut.texUV = ScreenUV;\0D\0A    return volumetricLightVSOut;\0D\0A}"}
!93 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_VS.hlsl"}
