#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSITION                 0   xyzw        1     NONE   float   xyzw
; TEX                      0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 75a707c24f422bb455722754bb2ed5f4.pdb
; shader hash: 75a707c24f422bb455722754bb2ed5f4
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; TEX                      0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer gLightInfo
; {
;
;   struct dx.alignment.legacy.gLightInfo
;   {
;
;       struct dx.alignment.legacy.struct.cLight
;       {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !25, globals: !82)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 52, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 52, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 52, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 52, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 52, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !15)
!24 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!25 = !{!26, !41}
!26 = !DISubprogram(name: "main", scope: !1, file: !1, line: 61, type: !27, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!27 = !DISubroutineType(types: !28)
!28 = !{!4, !29}
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "VolumetricLightVSOut", file: !1, line: 11, size: 320, align: 32, elements: !30)
!30 = !{!31, !32, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !29, file: !1, line: 13, baseType: !4, size: 128, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "positionCS", scope: !29, file: !1, line: 14, baseType: !4, size: 128, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "texUV", scope: !29, file: !1, line: 15, baseType: !34, size: 64, align: 32, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 33, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 33, size: 64, align: 32, elements: !36, templateParams: !39)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 33, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 33, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !{!13, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!41 = !DISubprogram(name: "GetCurrentPositionIntensity", linkageName: "\01?GetCurrentPositionIntensity@@YAMV?$vector@M$03@@UcLight@@@Z", scope: !1, file: !1, line: 42, type: !42, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!8, !4, !44}
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "cLight", file: !45, line: 54, size: 1664, align: 32, elements: !46)
!45 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/Lighting.hlsl", directory: "")
!46 = !{!47, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "gLightViewMatrix", scope: !44, file: !45, line: 56, baseType: !48, size: 512, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 20, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 20, size: 512, align: 32, elements: !50, templateParams: !67)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !49, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!67 = !{!13, !68, !69}
!68 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!69 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "gLightProjectMatrix", scope: !44, file: !45, line: 57, baseType: !48, size: 512, align: 32, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "gLightPosition", scope: !44, file: !45, line: 58, baseType: !4, size: 128, align: 32, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "gLightColor", scope: !44, file: !45, line: 59, baseType: !4, size: 128, align: 32, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gLightDirection", scope: !44, file: !45, line: 60, baseType: !4, size: 128, align: 32, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gShadowMapIndex", scope: !44, file: !45, line: 61, baseType: !15, size: 32, align: 32, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gLightType", scope: !44, file: !45, line: 62, baseType: !15, size: 32, align: 32, offset: 1440)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gInsensity", scope: !44, file: !45, line: 63, baseType: !8, size: 32, align: 32, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "conAngle", scope: !44, file: !45, line: 64, baseType: !8, size: 32, align: 32, offset: 1504)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "penumbraAngle", scope: !44, file: !45, line: 65, baseType: !8, size: 32, align: 32, offset: 1536)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "isCastShadow", scope: !44, file: !45, line: 66, baseType: !15, size: 32, align: 32, offset: 1568)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "lightIndex", scope: !44, file: !45, line: 67, baseType: !15, size: 32, align: 32, offset: 1600)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "gDescriptorOffset", scope: !44, file: !45, line: 68, baseType: !15, size: 32, align: 32, offset: 1632)
!82 = !{!83, !88, !90, !92, !94, !95, !96, !97, !98, !99, !101, !111, !112, !114, !115, !119, !123, !125, !127}
!83 = !DIGlobalVariable(name: "gLights", linkageName: "\01?gLights@gLightInfo@@3QBUcLight@@B", scope: !0, file: !1, line: 20, type: !84, isLocal: false, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 166400, align: 32, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!86 = !{!87}
!87 = !DISubrange(count: 100)
!88 = !DIGlobalVariable(name: "gInvViewProj", linkageName: "\01?gInvViewProj@VolumetricLightConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 25, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!90 = !DIGlobalVariable(name: "gCameraPos", linkageName: "\01?gCameraPos@VolumetricLightConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 26, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!92 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 27, type: !93, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!94 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 28, type: !93, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "gMarchingStep", linkageName: "\01?gMarchingStep@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 29, type: !93, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "gSampleIntensity", linkageName: "\01?gSampleIntensity@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 30, type: !93, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "gCameraNearZ", linkageName: "\01?gCameraNearZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 31, type: !93, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "gCameraFarZ", linkageName: "\01?gCameraFarZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 32, type: !93, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@VolumetricLightConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 33, type: !100, isLocal: false, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!101 = !DIGlobalVariable(name: "F0", scope: !0, file: !102, line: 1, type: !103, isLocal: true, isDefinition: true)
!102 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/CommonMath.hlsl", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 1, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 1, size: 96, align: 32, elements: !106, templateParams: !110)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !105, file: !1, line: 1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !105, file: !1, line: 1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !105, file: !1, line: 1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!110 = !{!13, !24}
!111 = !DIGlobalVariable(name: "PI", scope: !0, file: !102, line: 2, type: !93, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariable(name: "LinearWarp", linkageName: "\01?LinearWarp@@3USamplerState@@A", scope: !0, file: !1, line: 36, type: !113, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearWarp@@3USamplerState@@A")
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 36, size: 32, align: 32, elements: !2)
!114 = !DIGlobalVariable(name: "LinearClamp", linkageName: "\01?LinearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 37, type: !113, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "LightDepthMap", linkageName: "\01?LightDepthMap@@3PAV?$Texture2D@M@@A", scope: !0, file: !1, line: 39, type: !116, isLocal: false, isDefinition: true, variable: [100 x %"class.Texture2D<float>"]* @"\01?LightDepthMap@@3PAV?$Texture2D@M@@A")
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 6400, align: 32, elements: !86)
!117 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 39, size: 64, align: 32, elements: !2, templateParams: !118)
!118 = !{!13}
!119 = !DIGlobalVariable(name: "PresentMap", linkageName: "\01?PresentMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 40, type: !120, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?PresentMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 40, size: 160, align: 32, elements: !2, templateParams: !121)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "element", type: !5)
!123 = !DIGlobalVariable(name: "F0.2", linkageName: "F0.2", scope: !0, file: !102, line: 1, type: !124, isLocal: false, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !103, size: 32, align: 4, offset: 64)
!125 = !DIGlobalVariable(name: "F0.1", linkageName: "F0.1", scope: !0, file: !102, line: 1, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !103, size: 32, align: 4, offset: 32)
!127 = !DIGlobalVariable(name: "F0.0", linkageName: "F0.0", scope: !0, file: !102, line: 1, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !103, size: 32, align: 4)
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!132 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_PS.hlsl", !"/*\0D\0Afor volumetric light, about how light scattering occurs\0D\0Ahttps://advances.realtimerendering.com/s2014/wronski/bwronski_volumetric_fog_siggraph2014.pdf\0D\0Aconsidering Mie scattering and Rayleigh scattering\0D\0A\0D\0Acalculate phase function (HG phase function)\0D\0A*/\0D\0A\0D\0A#include \22Lighting.hlsl\22\0D\0A\0D\0Astruct VolumetricLightVSOut\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float4 positionCS : POSITION;\0D\0A    float2 texUV : TEX;\0D\0A};\0D\0A\0D\0Acbuffer gLightInfo : register(b0)\0D\0A{\0D\0A    cLight gLights[MAX_LIGHT_NUM];\0D\0A};\0D\0A\0D\0Acbuffer VolumetricLightConstants : register(b1)\0D\0A{\0D\0A    float4x4 gInvViewProj;\0D\0A    float4 gCameraPos;\0D\0A    float gScreenWidth;\0D\0A    float gScreenHeight;\0D\0A    float gMarchingStep;\0D\0A    float gSampleIntensity;\0D\0A    float gCameraNearZ;\0D\0A    float gCameraFarZ;\0D\0A    float2 padding0;\0D\0A};\0D\0A\0D\0ASamplerState LinearWarp : register(s16);\0D\0ASamplerState LinearClamp : register(s17);\0D\0A\0D\0ATexture2D<float> LightDepthMap[MAX_LIGHT_NUM] : register(t1);\0D\0ATexture2D<float4> PresentMap : register(t101);\0D\0A\0D\0Afloat GetCurrentPositionIntensity(float4 currPos, cLight l)\0D\0A{\0D\0A    float4 light_pos_vec = currPos - l.gLightPosition;\0D\0A    float angle = dot(light_pos_vec, l.gLightDirection) / (length(light_pos_vec) * length(l.gLightDirection));\0D\0A    if (acos(angle) > l.penumbraAngle)\0D\0A    {\0D\0A        return 0;\0D\0A    }\0D\0A    \0D\0A    float4 lightProjPos = mul(mul(currPos, l.gLightViewMatrix), l.gLightProjectMatrix);\0D\0A    float depthInLight = LightDepthMap[l.gDescriptorOffset].Load(int3(lightProjPos.x / lightProjPos.w * gScreenWidth, lightProjPos.y / lightProjPos.w * gScreenHeight, 0));\0D\0A    if (lightProjPos.z / lightProjPos.w > depthInLight)\0D\0A    {\0D\0A        return 0;\0D\0A    }\0D\0A    \0D\0A    return 0.5;\0D\0A}\0D\0A\0D\0Afloat4 main(VolumetricLightVSOut PresentIn) : SV_Target0\0D\0A{\0D\0A    float4 worldPos = mul(PresentIn.positionCS, gInvViewProj);\0D\0A    worldPos = worldPos / worldPos.w;\0D\0A    worldPos.z *= gCameraFarZ - gCameraNearZ;\0D\0A    float4 marchingDir = worldPos - gCameraPos;\0D\0A    float marchingLength = length(marchingDir);\0D\0A    float _step = marchingLength / gMarchingStep;\0D\0A    \0D\0A    float4 color = float4(0.0, 0.0, 0.0, 0.0);\0D\0A    for (int i = 0; i < MAX_LIGHT_NUM; i++)\0D\0A    {\0D\0A        cLight l = gLights[i];\0D\0A        if(l.isCastShadow == 0)\0D\0A        {\0D\0A            continue;\0D\0A        }\0D\0A        \0D\0A        float _intensity = 0;\0D\0A        for (float m = _step; m < marchingLength; m += _step)\0D\0A        {\0D\0A            float4 currPos = gCameraPos + marchingDir * m;\0D\0A            _intensity += GetCurrentPositionIntensity(currPos, l);\0D\0A        }\0D\0A        _intensity /= gMarchingStep;\0D\0A        \0D\0A        color += _intensity * l.gLightColor;\0D\0A    }\0D\0A    \0D\0A    return color + PresentMap.Sample(LinearWarp, PresentIn.texUV);\0D\0A}"}
