#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEX                      0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 9e7bef11fb5091749b0c11a931fc573d.pdb
; shader hash: 9e7bef11fb5091749b0c11a931fc573d
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEX                      0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer gLightInfo
; {
;
;   struct dx.alignment.legacy.gLightInfo
;   {
;
;       struct dx.alignment.legacy.struct.cLight
;       {
;
;           column_major float4x4 gLightViewMatrix;   ; Offset:    0
;           column_major float4x4 gLightProjectMatrix;; Offset:   64

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !81)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !23}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 65, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 65, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 65, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 65, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 32, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 32, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 32, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 32, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !22}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !25, templateParams: !30)
!25 = !{!26, !27, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 19, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !24, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !{!21, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!32 = !{!33, !40}
!33 = !DISubprogram(name: "main", scope: !1, file: !1, line: 63, type: !34, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!34 = !DISubroutineType(types: !35)
!35 = !{!23, !36}
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "VolumetricLightVSOut", file: !1, line: 11, size: 192, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !36, file: !1, line: 13, baseType: !23, size: 128, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "texUV", scope: !36, file: !1, line: 14, baseType: !14, size: 64, align: 32, offset: 128)
!40 = !DISubprogram(name: "GetCurrentPositionIntensity", linkageName: "\01?GetCurrentPositionIntensity@@YAMV?$vector@M$03@@UcLight@@@Z", scope: !1, file: !1, line: 42, type: !41, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DISubroutineType(types: !42)
!42 = !{!18, !23, !43}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "cLight", file: !44, line: 54, size: 1664, align: 32, elements: !45)
!44 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/Lighting.hlsl", directory: "")
!45 = !{!46, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "gLightViewMatrix", scope: !43, file: !44, line: 56, baseType: !47, size: 512, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 19, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 19, size: 512, align: 32, elements: !49, templateParams: !66)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !48, file: !1, line: 19, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!66 = !{!21, !67, !68}
!67 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!68 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "gLightProjectMatrix", scope: !43, file: !44, line: 57, baseType: !47, size: 512, align: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "gLightPosition", scope: !43, file: !44, line: 58, baseType: !23, size: 128, align: 32, offset: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "gLightColor", scope: !43, file: !44, line: 59, baseType: !23, size: 128, align: 32, offset: 1152)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "gLightDirection", scope: !43, file: !44, line: 60, baseType: !23, size: 128, align: 32, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gShadowMapIndex", scope: !43, file: !44, line: 61, baseType: !8, size: 32, align: 32, offset: 1408)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gLightType", scope: !43, file: !44, line: 62, baseType: !8, size: 32, align: 32, offset: 1440)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gInsensity", scope: !43, file: !44, line: 63, baseType: !18, size: 32, align: 32, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "conAngle", scope: !43, file: !44, line: 64, baseType: !18, size: 32, align: 32, offset: 1504)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "penumbraAngle", scope: !43, file: !44, line: 65, baseType: !18, size: 32, align: 32, offset: 1536)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "isCastShadow", scope: !43, file: !44, line: 66, baseType: !8, size: 32, align: 32, offset: 1568)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "lightIndex", scope: !43, file: !44, line: 67, baseType: !8, size: 32, align: 32, offset: 1600)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gDescriptorOffset", scope: !43, file: !44, line: 68, baseType: !8, size: 32, align: 32, offset: 1632)
!81 = !{!82, !87, !89, !91, !93, !94, !95, !96, !97, !98, !100, !110, !111, !113, !114, !117, !119, !123, !125, !127}
!82 = !DIGlobalVariable(name: "gLights", linkageName: "\01?gLights@gLightInfo@@3QBUcLight@@B", scope: !0, file: !1, line: 19, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 4992, align: 32, elements: !85)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!85 = !{!86}
!86 = !DISubrange(count: 3)
!87 = !DIGlobalVariable(name: "gInvViewProj", linkageName: "\01?gInvViewProj@VolumetricLightConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 24, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!89 = !DIGlobalVariable(name: "gCameraPos", linkageName: "\01?gCameraPos@VolumetricLightConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 25, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!91 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 26, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!93 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 27, type: !92, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "gMarchingStep", linkageName: "\01?gMarchingStep@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 28, type: !92, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "gSampleIntensity", linkageName: "\01?gSampleIntensity@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 29, type: !92, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "gCameraNearZ", linkageName: "\01?gCameraNearZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 30, type: !92, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "gCameraFarZ", linkageName: "\01?gCameraFarZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 31, type: !92, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@VolumetricLightConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 32, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!100 = !DIGlobalVariable(name: "F0", scope: !0, file: !101, line: 1, type: !102, isLocal: true, isDefinition: true)
!101 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/CommonMath.hlsl", directory: "")
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 1, baseType: !104)
!104 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 1, size: 96, align: 32, elements: !105, templateParams: !109)
!105 = !{!106, !107, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !104, file: !1, line: 1, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !104, file: !1, line: 1, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !104, file: !1, line: 1, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!109 = !{!21, !13}
!110 = !DIGlobalVariable(name: "PI", scope: !0, file: !101, line: 2, type: !92, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariable(name: "LinearWarp", linkageName: "\01?LinearWarp@@3USamplerState@@A", scope: !0, file: !1, line: 35, type: !112, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearWarp@@3USamplerState@@A")
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 35, size: 32, align: 32, elements: !2)
!113 = !DIGlobalVariable(name: "LinearClamp", linkageName: "\01?LinearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 36, type: !112, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "gCameraDepthMap", linkageName: "\01?gCameraDepthMap@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 38, type: !115, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?gCameraDepthMap@@3V?$Texture2D@M@@A")
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 38, size: 64, align: 32, elements: !2, templateParams: !116)
!116 = !{!21}
!117 = !DIGlobalVariable(name: "LightDepthMap", linkageName: "\01?LightDepthMap@@3PAV?$Texture2D@M@@A", scope: !0, file: !1, line: 39, type: !118, isLocal: false, isDefinition: true, variable: [3 x %"class.Texture2D<float>"]* @"\01?LightDepthMap@@3PAV?$Texture2D@M@@A")
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 192, align: 32, elements: !85)
!119 = !DIGlobalVariable(name: "PresentMap", linkageName: "\01?PresentMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 40, type: !120, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?PresentMap@@3V?$Texture2D@V?$vector@M$03@@@@A")
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 40, size: 160, align: 32, elements: !2, templateParams: !121)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "element", type: !24)
!123 = !DIGlobalVariable(name: "F0.1", linkageName: "F0.1", scope: !0, file: !101, line: 1, type: !124, isLocal: false, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !102, size: 32, align: 4, offset: 32)
!125 = !DIGlobalVariable(name: "F0.2", linkageName: "F0.2", scope: !0, file: !101, line: 1, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !102, size: 32, align: 4, offset: 64)
!127 = !DIGlobalVariable(name: "F0.0", linkageName: "F0.0", scope: !0, file: !101, line: 1, type: !128, isLocal: false, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !102, size: 32, align: 4)
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!132 = !{!"D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_PS.hlsl", !"/*\0D\0Afor volumetric light, about how light scattering occurs\0D\0Ahttps://advances.realtimerendering.com/s2014/wronski/bwronski_volumetric_fog_siggraph2014.pdf\0D\0Aconsidering Mie scattering and Rayleigh scattering\0D\0A\0D\0Acalculate phase function (HG phase function)\0D\0A*/\0D\0A\0D\0A#include \22Lighting.hlsl\22\0D\0A\0D\0Astruct VolumetricLightVSOut\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float2 texUV : TEX;\0D\0A};\0D\0A\0D\0Acbuffer gLightInfo : register(b0)\0D\0A{\0D\0A    cLight gLights[3];\0D\0A};\0D\0A\0D\0Acbuffer VolumetricLightConstants : register(b1)\0D\0A{\0D\0A    float4x4 gInvViewProj;\0D\0A    float4 gCameraPos;\0D\0A    float gScreenWidth;\0D\0A    float gScreenHeight;\0D\0A    float gMarchingStep;\0D\0A    float gSampleIntensity;\0D\0A    float gCameraNearZ;\0D\0A    float gCameraFarZ;\0D\0A    float2 padding0;\0D\0A};\0D\0A\0D\0ASamplerState LinearWarp : register(s16);\0D\0ASamplerState LinearClamp : register(s17);\0D\0A\0D\0ATexture2D<float> gCameraDepthMap : register(t0);\0D\0ATexture2D<float> LightDepthMap[3] : register(t1);\0D\0ATexture2D<float4> PresentMap : register(t101);\0D\0A\0D\0Afloat GetCurrentPositionIntensity(float4 currPos, cLight l)\0D\0A{\0D\0A    float4 light_pos_vec = currPos - l.gLightPosition;\0D\0A    float angle = dot(light_pos_vec, l.gLightDirection) / (length(light_pos_vec) * length(l.gLightDirection));\0D\0A    angle = acos(angle);\0D\0A    if (angle > l.penumbraAngle)\0D\0A    {\0D\0A        return 0;\0D\0A    }\0D\0A    \0D\0A    float4 lightProjPos = mul(mul(currPos, transpose(l.gLightViewMatrix)), transpose(l.gLightProjectMatrix));\0D\0A    int3 load = int3((lightProjPos.x / lightProjPos.w + 1) * 0.5 * gScreenWidth, (1 - lightProjPos.y / lightProjPos.w * 0.5) * gScreenHeight, 0);\0D\0A    float depthInLight = LightDepthMap[l.gDescriptorOffset].Load(load);\0D\0A    if (lightProjPos.z / lightProjPos.w > depthInLight)\0D\0A    {\0D\0A        return 0;\0D\0A    }\0D\0A    \0D\0A    return gSampleIntensity;\0D\0A}\0D\0A\0D\0Afloat4 main(VolumetricLightVSOut PresentIn) : SV_Target0\0D\0A{\0D\0A    float depth = gCameraDepthMap.Load(int3(PresentIn.texUV.x * gScreenWidth, PresentIn.texUV.y * gScreenHeight, 0));\0D\0A    float2 interp = lerp(float2(-1, 1), float2(1, -1), PresentIn.texUV);\0D\0A    float4 projPos = float4(interp, depth, 1.0);\0D\0A    float4 worldPos = mul(projPos, gInvViewProj);\0D\0A    worldPos = worldPos / worldPos.w;\0D\0A    float4 marchingDir = worldPos - gCameraPos;\0D\0A    float marchingLength = length(marchingDir);\0D\0A    marchingDir = marchingDir / length(marchingDir);\0D\0A    float _step = marchingLength / gMarchingStep;\0D\0A    \0D\0A    float4 color = float4(0.0, 0.0, 0.0, 0.0);\0D\0A    for (int i = 0; i < MAX_LIGHT_NUM; i++)\0D\0A    {\0D\0A        cLight l = gLights[i];\0D\0A        if(l.isCastShadow == 0)\0D\0A        {\0D\0A            continue;\0D\0A        }\0D\0A        \0D\0A        float _intensity = 0;\0D\0A        for (float m = _step; m < marchingLength; m += _step)\0D\0A        {\0D\0A            float4 currPos = gCameraPos + marchingDir * m;\0D\0A            _intensity += GetCurrentPositionIntensity(currPos, l);\0D\0A        }\0D\0A        _intensity /= gMarchingStep;\0D\0A        \0D\0A        color += _intensity * l.gLightColor;\0D\0A    }\0D\0A    \0D\0A    return color + PresentMap.Sample(LinearWarp, PresentIn.texUV);\0D\0A}"}
