#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEX                      0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: f32db97cbfc1916a6bf11ccaa247dae9.pdb
; shader hash: f32db97cbfc1916a6bf11ccaa247dae9
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEX                      0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer gLightInfo
; {
;
;   struct dx.alignment.legacy.gLightInfo
;   {
;
;       struct dx.alignment.legacy.struct.cLight
;       {
;
;           column_major float4x4 gLightViewMatrix;   ; Offset:    0
;           column_major float4x4 gLightProjectMatrix;; Offset:   64

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !115)
!1 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !23, !32}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 171, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 171, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 171, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 171, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 33, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 33, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 33, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 33, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !22}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !25, templateParams: !30)
!25 = !{!26, !27, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 20, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !24, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !{!21, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 9, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 9, size: 96, align: 32, elements: !34, templateParams: !38)
!34 = !{!35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, line: 9, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, line: 9, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !33, file: !1, line: 9, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !{!21, !13}
!39 = !{!40, !47, !88, !94, !97, !108, !111, !112}
!40 = !DISubprogram(name: "main", scope: !1, file: !1, line: 169, type: !41, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DISubroutineType(types: !42)
!42 = !{!23, !43}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VolumetricLightVSOut", file: !1, line: 12, size: 192, align: 32, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !43, file: !1, line: 14, baseType: !23, size: 128, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "texUV", scope: !43, file: !1, line: 15, baseType: !14, size: 64, align: 32, offset: 128)
!47 = !DISubprogram(name: "GetSpotLightIntensity", linkageName: "\01?GetSpotLightIntensity@@YA?AV?$vector@M$03@@V?$vector@M$02@@UcLight@@MV?$vector@M$01@@@Z", scope: !1, file: !1, line: 132, type: !48, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!23, !32, !50, !18, !14}
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "cLight", file: !51, line: 61, size: 1664, align: 32, elements: !52)
!51 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/Lighting.hlsl", directory: "")
!52 = !{!53, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "gLightViewMatrix", scope: !50, file: !51, line: 63, baseType: !54, size: 512, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 20, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 20, size: 512, align: 32, elements: !56, templateParams: !73)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !55, file: !1, line: 20, baseType: !18, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!73 = !{!21, !74, !75}
!74 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!75 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "gLightProjectMatrix", scope: !50, file: !51, line: 64, baseType: !54, size: 512, align: 32, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gLightPosition", scope: !50, file: !51, line: 65, baseType: !23, size: 128, align: 32, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gLightColor", scope: !50, file: !51, line: 66, baseType: !23, size: 128, align: 32, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gLightDirection", scope: !50, file: !51, line: 67, baseType: !23, size: 128, align: 32, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gShadowMapIndex", scope: !50, file: !51, line: 68, baseType: !8, size: 32, align: 32, offset: 1408)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "gLightType", scope: !50, file: !51, line: 69, baseType: !8, size: 32, align: 32, offset: 1440)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gInsensity", scope: !50, file: !51, line: 70, baseType: !18, size: 32, align: 32, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "conAngle", scope: !50, file: !51, line: 71, baseType: !18, size: 32, align: 32, offset: 1504)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "penumbraAngle", scope: !50, file: !51, line: 72, baseType: !18, size: 32, align: 32, offset: 1536)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "isCastShadow", scope: !50, file: !51, line: 73, baseType: !8, size: 32, align: 32, offset: 1568)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "lightIndex", scope: !50, file: !51, line: 74, baseType: !8, size: 32, align: 32, offset: 1600)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "gDescriptorOffset", scope: !50, file: !51, line: 75, baseType: !8, size: 32, align: 32, offset: 1632)
!88 = !DISubprogram(name: "GetLightIntersection", linkageName: "\01?GetLightIntersection@@YA_NV?$vector@M$02@@0UcLight@@MAIAM2@Z", scope: !1, file: !1, line: 85, type: !89, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !32, !32, !50, !18, !92, !92}
!91 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!92 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !18)
!94 = !DISubprogram(name: "GetCurrentPositionIntensity", linkageName: "\01?GetCurrentPositionIntensity@@YA?AV?$vector@M$03@@V1@UcLight@@@Z", scope: !1, file: !1, line: 43, type: !95, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{!23, !23, !50}
!97 = !DISubprogram(name: "RayleighCoefficient", linkageName: "\01?RayleighCoefficient@@YA?AV?$vector@M$02@@UAtmosphereParam@@M@Z", scope: !98, file: !98, line: 30, type: !99, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/Atmosphere/BaseScattering.hlsl", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!32, !101, !18}
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtmosphereParam", file: !102, line: 4, size: 128, align: 32, elements: !103)
!102 = !DIFile(filename: "D:\5CEngine\5CGitEngine\5Cnewtrunk\5CAsset\5CShaders\5Chlsl\5CAlgorithm/Atmosphere/AtmosphereDefine.hlsl", directory: "")
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Rayliegh_Scalar_Height", scope: !101, file: !102, line: 6, baseType: !18, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Mie_Scalar_Height", scope: !101, file: !102, line: 7, baseType: !18, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Mie_Anisotropy_G", scope: !101, file: !102, line: 8, baseType: !18, size: 32, align: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "padding0", scope: !101, file: !102, line: 9, baseType: !18, size: 32, align: 32, offset: 96)
!108 = !DISubprogram(name: "RayleighPhase", linkageName: "\01?RayleighPhase@@YAMM@Z", scope: !98, file: !98, line: 37, type: !109, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!18, !18}
!111 = !DISubprogram(name: "MieCoefficient", linkageName: "\01?MieCoefficient@@YA?AV?$vector@M$02@@UAtmosphereParam@@M@Z", scope: !98, file: !98, line: 43, type: !99, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!112 = !DISubprogram(name: "MiePhase", linkageName: "\01?MiePhase@@YAMUAtmosphereParam@@M@Z", scope: !98, file: !98, line: 49, type: !113, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!113 = !DISubroutineType(types: !114)
!114 = !{!18, !101, !18}
!115 = !{!116, !121, !123, !125, !127, !128, !129, !130, !131, !132, !134, !136, !138, !139, !142, !143, !147, !149, !151}
!116 = !DIGlobalVariable(name: "gLights", linkageName: "\01?gLights@gLightInfo@@3QBUcLight@@B", scope: !0, file: !1, line: 20, type: !117, isLocal: false, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 4992, align: 32, elements: !119)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DIGlobalVariable(name: "gInvViewProj", linkageName: "\01?gInvViewProj@VolumetricLightConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 25, type: !122, isLocal: false, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!123 = !DIGlobalVariable(name: "gCameraPos", linkageName: "\01?gCameraPos@VolumetricLightConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 26, type: !124, isLocal: false, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!125 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 27, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!127 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 28, type: !126, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "gMarchingStep", linkageName: "\01?gMarchingStep@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 29, type: !126, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "gSampleIntensity", linkageName: "\01?gSampleIntensity@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 30, type: !126, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "gCameraNearZ", linkageName: "\01?gCameraNearZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 31, type: !126, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "gCameraFarZ", linkageName: "\01?gCameraFarZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 32, type: !126, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@VolumetricLightConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 33, type: !133, isLocal: false, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!134 = !DIGlobalVariable(name: "F0", scope: !0, file: !51, line: 9, type: !135, isLocal: true, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!136 = !DIGlobalVariable(name: "LinearWarp", linkageName: "\01?LinearWarp@@3USamplerState@@A", scope: !0, file: !1, line: 36, type: !137, isLocal: false, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 36, size: 32, align: 32, elements: !2)
!138 = !DIGlobalVariable(name: "LinearClamp", linkageName: "\01?LinearClamp@@3USamplerState@@A", scope: !0, file: !1, line: 37, type: !137, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariable(name: "gCameraDepthMap", linkageName: "\01?gCameraDepthMap@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 39, type: !140, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?gCameraDepthMap@@3V?$Texture2D@M@@A")
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 39, size: 64, align: 32, elements: !2, templateParams: !141)
!141 = !{!21}
!142 = !DIGlobalVariable(name: "LightDepthMap", linkageName: "\01?LightDepthMap@@3V?$Texture2D@M@@A", scope: !0, file: !1, line: 40, type: !140, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?LightDepthMap@@3V?$Texture2D@M@@A")
!143 = !DIGlobalVariable(name: "PresentMap", linkageName: "\01?PresentMap@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 41, type: !144, isLocal: false, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 41, size: 160, align: 32, elements: !2, templateParams: !145)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "element", type: !24)
!147 = !DIGlobalVariable(name: "F0.2", linkageName: "F0.2", scope: !0, file: !51, line: 9, type: !148, isLocal: false, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !135, size: 32, align: 4, offset: 64)
!149 = !DIGlobalVariable(name: "F0.1", linkageName: "F0.1", scope: !0, file: !51, line: 9, type: !150, isLocal: false, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !135, size: 32, align: 4, offset: 32)
!151 = !DIGlobalVariable(name: "F0.0", linkageName: "F0.0", scope: !0, file: !51, line: 9, type: !152, isLocal: false, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !135, size: 32, align: 4)
!153 = !{i32 2, !"Dwarf Version", i32 4}
!154 = !{i32 2, !"Debug Info Version", i32 3}
!155 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
