#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_VertexID              0   x           0   VERTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEX                      0   xy          1     NONE   float   xy  
;
; shader debug name: 78d9304621428438da348d93710d7954.pdb
; shader hash: 78d9304621428438da348d93710d7954
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_VertexID              0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEX                      0                 linear       
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
;
; ViewId state:
;
; Number of inputs: 1, outputs: 6

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !40)
!1 = !DIFile(filename: "G:\5CEngine_file\5CgameEngine\5CGameEngineStart\5CGameEngine\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 11, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 11, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 11, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 11, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 22, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 22, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 22, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 22, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 4, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 4, size: 128, align: 32, elements: !24, templateParams: !29)
!24 = !{!25, !26, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 4, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!29 = !{!11, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!31 = !{!32}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !33, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !39}
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "VolumetricLightVSOut", file: !1, line: 14, size: 192, align: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !35, file: !1, line: 16, baseType: !22, size: 128, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "texUV", scope: !35, file: !1, line: 17, baseType: !4, size: 64, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 11, baseType: !18)
!40 = !{!41, !65, !67, !69, !70, !71, !72, !73, !74}
!41 = !DIGlobalVariable(name: "gInvViewProj", linkageName: "\01?gInvViewProj@VolumetricLightConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !42, isLocal: false, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !45, templateParams: !62)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !44, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!62 = !{!11, !63, !64}
!63 = !DITemplateValueParameter(name: "row_count", type: !13, value: i32 4)
!64 = !DITemplateValueParameter(name: "col_count", type: !13, value: i32 4)
!65 = !DIGlobalVariable(name: "gCameraPos", linkageName: "\01?gCameraPos@VolumetricLightConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 4, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!67 = !DIGlobalVariable(name: "gScreenWidth", linkageName: "\01?gScreenWidth@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 5, type: !68, isLocal: false, isDefinition: true)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!69 = !DIGlobalVariable(name: "gScreenHeight", linkageName: "\01?gScreenHeight@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 6, type: !68, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "gMarchingStep", linkageName: "\01?gMarchingStep@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 7, type: !68, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "gSampleIntensity", linkageName: "\01?gSampleIntensity@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 8, type: !68, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "gCameraNearZ", linkageName: "\01?gCameraNearZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 9, type: !68, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariable(name: "gCameraFarZ", linkageName: "\01?gCameraFarZ@VolumetricLightConstants@@3MB", scope: !0, file: !1, line: 10, type: !68, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "padding0", linkageName: "\01?padding0@VolumetricLightConstants@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 11, type: !75, isLocal: false, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!79 = !{!"G:\5CEngine_file\5CgameEngine\5CGameEngineStart\5CGameEngine\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_VS.hlsl", !"cbuffer VolumetricLightConstants : register(b1)\0D\0A{\0D\0A    float4x4 gInvViewProj;\0D\0A    float4 gCameraPos;\0D\0A    float gScreenWidth;\0D\0A    float gScreenHeight;\0D\0A    float gMarchingStep;\0D\0A    float gSampleIntensity;\0D\0A    float gCameraNearZ;\0D\0A    float gCameraFarZ;\0D\0A    float2 padding0;\0D\0A};\0D\0A\0D\0Astruct VolumetricLightVSOut\0D\0A{\0D\0A    float4 position : SV_POSITION;\0D\0A    float2 texUV : TEX;\0D\0A};\0D\0A\0D\0AVolumetricLightVSOut main(uint VertID : SV_VertexID)\0D\0A{\0D\0A    float2 ScreenUV = float2(uint2(VertID, VertID << 1) & 2);\0D\0A    float2 texUV = lerp(float2(-1, 1), float2(1, -1), ScreenUV);\0D\0A    VolumetricLightVSOut volumetricLightVSOut;\0D\0A    volumetricLightVSOut.position = float4(texUV, 0, 1);\0D\0A    volumetricLightVSOut.texUV = ScreenUV;\0D\0A    return volumetricLightVSOut;\0D\0A}"}
!80 = !{!"G:\5CEngine_file\5CgameEngine\5CGameEngineStart\5CGameEngine\5CAsset\5CShaders\5Chlsl\5CAlgorithm\5CVolumetricLight_VS.hlsl"}
!81 = !{!"-E", !"main", !"-T", !"vs_6_3", !"/Od", !"/Zi", !"-Qembed_debug"}
!82 = !{i32 1, i32 3}
!83 = !{i32 1, i32 6}
!84 = !{!"vs", i32 6, i32 3}
!85 = !{i32 0, %struct.VolumetricLightVSOut undef, !86}
!86 = !{i32 24, !87, !88}
!87 = !{i32 6, !"position", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!88 = !{i32 6, !"texUV", i32 3, i32 16, i32 4, !"TEX", i32 7, i32 9}
!89 = !{i32 1, void ()* @main, !90}
!90 = !{!91}
!91 = !{i32 0, !2, !2}
!92 = !{[3 x i32] [i32 1, i32 6, i32 51]}
!93 = !{void ()* @main, !"main", !94, null, !104}
!94 = !{!95, !99, null}
!95 = !{!96}
!96 = !{i32 0, !"SV_VertexID", i8 5, i8 1, !97, i8 0, i32 1, i8 1, i32 0, i8 0, !98}
!97 = !{i32 0}
!98 = !{i32 3, i32 1}
